[Survived] StringLiteral
put-it-up/scripts/board-items/sticky.js:1:28
-export const STICKY_TYPE = "application/sticky";
+export const STICKY_TYPE = "";
 export const DEFAULT_STICKY_COLOR = "khaki";
 

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:26:26
 ) =>
   function renderSticky(stickyId, sticky) {
     const selectedStickies = getSelectedStickies();
-    const shouldDelete = sticky === undefined;
+    const shouldDelete = true;
     const container = getStickyElement(
       domElement,

[Survived] EqualityOperator
put-it-up/scripts/board-items/sticky.js:26:26
 ) =>
   function renderSticky(stickyId, sticky) {
     const selectedStickies = getSelectedStickies();
-    const shouldDelete = sticky === undefined;
+    const shouldDelete = sticky !== undefined;
     const container = getStickyElement(
       domElement,

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:36:9
       shouldDelete
     );
     // if container is falsy, then sticky was deleted
-    if (container) {
+    if (false) {
       const shouldAnimateMove = !stickiesMovedByDragging.includes(stickyId);
       const stickyIsSelected = selectedStickies.data[stickyId];

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:36:9
       shouldDelete
     );
     // if container is falsy, then sticky was deleted
-    if (container) {
+    if (true) {
       const shouldAnimateMove = !stickiesMovedByDragging.includes(stickyId);
       const stickyIsSelected = selectedStickies.data[stickyId];

[Survived] BooleanLiteral
put-it-up/scripts/board-items/sticky.js:37:33
     );
     // if container is falsy, then sticky was deleted
     if (container) {
-      const shouldAnimateMove = !stickiesMovedByDragging.includes(stickyId);
+      const shouldAnimateMove = stickiesMovedByDragging.includes(stickyId);
       const stickyIsSelected = selectedStickies.data[stickyId];
       setStickyStyles(

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:46:31
         stickyIsSelected,
         board.getOrigin()
       );
-      if (!shouldAnimateMove) {
-        stickiesMovedByDragging = stickiesMovedByDragging.filter(
-          (sid) => sid !== stickyId
-        );
-      }
+      if (!shouldAnimateMove) {}
       const textarea = container.inputElement;
       if (textarea.value !== sticky.text) {

[Survived] BooleanLiteral
put-it-up/scripts/board-items/sticky.js:46:11
         stickyIsSelected,
         board.getOrigin()
       );
-      if (!shouldAnimateMove) {
+      if (shouldAnimateMove) {
         stickiesMovedByDragging = stickiesMovedByDragging.filter(
           (sid) => sid !== stickyId

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:48:20
       );
       if (!shouldAnimateMove) {
         stickiesMovedByDragging = stickiesMovedByDragging.filter(
-          (sid) => sid !== stickyId
+          (sid) => true
         );
       }

[Survived] EqualityOperator
put-it-up/scripts/board-items/sticky.js:48:20
       );
       if (!shouldAnimateMove) {
         stickiesMovedByDragging = stickiesMovedByDragging.filter(
-          (sid) => sid !== stickyId
+          (sid) => sid === stickyId
         );
       }

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:52:11
         );
       }
       const textarea = container.inputElement;
-      if (textarea.value !== sticky.text) {
+      if (true) {
         textarea.value = sticky.text;
         fitContentInSticky(container.sticky, textarea);

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:52:43
         );
       }
       const textarea = container.inputElement;
-      if (textarea.value !== sticky.text) {
-        textarea.value = sticky.text;
-        fitContentInSticky(container.sticky, textarea);
-      }
+      if (textarea.value !== sticky.text) {}
       // ordering
       const elementsOnBoard = [...domElement.children];

[Survived] BooleanLiteral
put-it-up/scripts/board-items/sticky.js:59:27
       // ordering
       const elementsOnBoard = [...domElement.children];
       const activeElement = document.activeElement;
-      let shouldRefocus = false;
+      let shouldRefocus = true;
       if (elementsOnBoard.some((el) => el.contains(activeElement))) {
         shouldRefocus = true;

[Survived] ArrowFunction
put-it-up/scripts/board-items/sticky.js:60:32
       const elementsOnBoard = [...domElement.children];
       const activeElement = document.activeElement;
       let shouldRefocus = false;
-      if (elementsOnBoard.some((el) => el.contains(activeElement))) {
+      if (elementsOnBoard.some(() => undefined)) {
         shouldRefocus = true;
       }

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:60:11
       const elementsOnBoard = [...domElement.children];
       const activeElement = document.activeElement;
       let shouldRefocus = false;
-      if (elementsOnBoard.some((el) => el.contains(activeElement))) {
+      if (false) {
         shouldRefocus = true;
       }

[Survived] BooleanLiteral
put-it-up/scripts/board-items/sticky.js:61:25
       const activeElement = document.activeElement;
       let shouldRefocus = false;
       if (elementsOnBoard.some((el) => el.contains(activeElement))) {
-        shouldRefocus = true;
+        shouldRefocus = false;
       }
       elementsOnBoard.sort((a, b) => {

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:63:38
       if (elementsOnBoard.some((el) => el.contains(activeElement))) {
         shouldRefocus = true;
       }
-      elementsOnBoard.sort((a, b) => {
-        let yDif = removePx(a.style.top) - removePx(b.style.top);
-        if (yDif === 0) {
-          const xDif = removePx(a.style.left) - removePx(b.style.left);
-          if (xDif === 0) {
-            return b.className > a.className;
-          }
-          return xDif;
-        }
-        return yDif;
-      });
+      elementsOnBoard.sort((a, b) => {});
       elementsOnBoard.forEach((el) => domElement.appendChild(el));
       if (shouldRefocus) {

[Survived] ArithmeticOperator
put-it-up/scripts/board-items/sticky.js:64:20
         shouldRefocus = true;
       }
       elementsOnBoard.sort((a, b) => {
-        let yDif = removePx(a.style.top) - removePx(b.style.top);
+        let yDif = removePx(a.style.top) + removePx(b.style.top);
         if (yDif === 0) {
           const xDif = removePx(a.style.left) - removePx(b.style.left);

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:65:13
       }
       elementsOnBoard.sort((a, b) => {
         let yDif = removePx(a.style.top) - removePx(b.style.top);
-        if (yDif === 0) {
+        if (false) {
           const xDif = removePx(a.style.left) - removePx(b.style.left);
           if (xDif === 0) {

[Survived] EqualityOperator
put-it-up/scripts/board-items/sticky.js:65:13
       }
       elementsOnBoard.sort((a, b) => {
         let yDif = removePx(a.style.top) - removePx(b.style.top);
-        if (yDif === 0) {
+        if (yDif !== 0) {
           const xDif = removePx(a.style.left) - removePx(b.style.left);
           if (xDif === 0) {

[Survived] ArithmeticOperator
put-it-up/scripts/board-items/sticky.js:66:24
       elementsOnBoard.sort((a, b) => {
         let yDif = removePx(a.style.top) - removePx(b.style.top);
         if (yDif === 0) {
-          const xDif = removePx(a.style.left) - removePx(b.style.left);
+          const xDif = removePx(a.style.left) + removePx(b.style.left);
           if (xDif === 0) {
             return b.className > a.className;

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:67:15
         let yDif = removePx(a.style.top) - removePx(b.style.top);
         if (yDif === 0) {
           const xDif = removePx(a.style.left) - removePx(b.style.left);
-          if (xDif === 0) {
+          if (false) {
             return b.className > a.className;
           }

[Survived] EqualityOperator
put-it-up/scripts/board-items/sticky.js:67:15
         let yDif = removePx(a.style.top) - removePx(b.style.top);
         if (yDif === 0) {
           const xDif = removePx(a.style.left) - removePx(b.style.left);
-          if (xDif === 0) {
+          if (xDif !== 0) {
             return b.className > a.className;
           }

[Survived] EqualityOperator
put-it-up/scripts/board-items/sticky.js:68:20
         if (yDif === 0) {
           const xDif = removePx(a.style.left) - removePx(b.style.left);
           if (xDif === 0) {
-            return b.className > a.className;
+            return b.className <= a.className;
           }
           return xDif;

[Survived] EqualityOperator
put-it-up/scripts/board-items/sticky.js:68:20
         if (yDif === 0) {
           const xDif = removePx(a.style.left) - removePx(b.style.left);
           if (xDif === 0) {
-            return b.className > a.className;
+            return b.className >= a.className;
           }
           return xDif;

[Survived] ArrowFunction
put-it-up/scripts/board-items/sticky.js:74:31
         }
         return yDif;
       });
-      elementsOnBoard.forEach((el) => domElement.appendChild(el));
+      elementsOnBoard.forEach(() => undefined);
       if (shouldRefocus) {
         activeElement.focus();

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:75:11
         return yDif;
       });
       elementsOnBoard.forEach((el) => domElement.appendChild(el));
-      if (shouldRefocus) {
+      if (false) {
         activeElement.focus();
       }

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:75:11
         return yDif;
       });
       elementsOnBoard.forEach((el) => domElement.appendChild(el));
-      if (shouldRefocus) {
+      if (true) {
         activeElement.focus();
       }

[Survived] BooleanLiteral
put-it-up/scripts/board-items/sticky.js:87:18
   updateTextById,
   getStickyLocation,
   selectedStickies,
-  shouldDelete = false
+  shouldDelete = true
 ) {
   const stickyIdClass = "sticky-" + id;

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:91:7
 ) {
   const stickyIdClass = "sticky-" + id;
   let container = boardElement[stickyIdClass];
-  if (shouldDelete) {
+  if (false) {
     delete boardElement[stickyIdClass];
     if (container) {

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:91:21
 ) {
   const stickyIdClass = "sticky-" + id;
   let container = boardElement[stickyIdClass];
-  if (shouldDelete) {
-    delete boardElement[stickyIdClass];
-    if (container) {
-      boardElement.removeChild(container);
-    }
-    container = undefined;
-  } else if (!container) {
+  if (shouldDelete) {} else if (!container) {
     container = createStickyContainerDOM(stickyIdClass);
     boardElement[stickyIdClass] = container;

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:93:9
   let container = boardElement[stickyIdClass];
   if (shouldDelete) {
     delete boardElement[stickyIdClass];
-    if (container) {
+    if (true) {
       boardElement.removeChild(container);
     }

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:93:9
   let container = boardElement[stickyIdClass];
   if (shouldDelete) {
     delete boardElement[stickyIdClass];
-    if (container) {
+    if (false) {
       boardElement.removeChild(container);
     }

[Survived] BooleanLiteral
put-it-up/scripts/board-items/sticky.js:97:14
       boardElement.removeChild(container);
     }
     container = undefined;
-  } else if (!container) {
+  } else if (container) {
     container = createStickyContainerDOM(stickyIdClass);
     boardElement[stickyIdClass] = container;

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:97:14
       boardElement.removeChild(container);
     }
     container = undefined;
-  } else if (!container) {
+  } else if (true) {
     container = createStickyContainerDOM(stickyIdClass);
     boardElement[stickyIdClass] = container;

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:101:40
     container = createStickyContainerDOM(stickyIdClass);
     boardElement[stickyIdClass] = container;
     boardElement.appendChild(container);
-    container.ondragstart = (event) => {
-      const { pageX: x, pageY: y } = event;
-      let originalLocations = {};
-      if (selectedStickies.isSelected(id)) {
-        selectedStickies.forEach((sid) => {
-          originalLocations[sid] = getStickyLocation(sid);
-        });
-      } else {
-        originalLocations[id] = getStickyLocation(id);
-      }
-      event.dataTransfer.setData(
-        STICKY_TYPE,
-        JSON.stringify({ originalLocations, dragStart: { x, y } })
-      );
-      moveToFront();
-    };
+    container.ondragstart = (event) => {};
     function setEditable(enabled) {
       if (enabled) {

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:104:11
     container.ondragstart = (event) => {
       const { pageX: x, pageY: y } = event;
       let originalLocations = {};
-      if (selectedStickies.isSelected(id)) {
+      if (true) {
         selectedStickies.forEach((sid) => {
           originalLocations[sid] = getStickyLocation(sid);

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:104:44
     container.ondragstart = (event) => {
       const { pageX: x, pageY: y } = event;
       let originalLocations = {};
-      if (selectedStickies.isSelected(id)) {
-        selectedStickies.forEach((sid) => {
-          originalLocations[sid] = getStickyLocation(sid);
-        });
-      } else {
+      if (selectedStickies.isSelected(id)) {} else {
         originalLocations[id] = getStickyLocation(id);
       }

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:105:43
       const { pageX: x, pageY: y } = event;
       let originalLocations = {};
       if (selectedStickies.isSelected(id)) {
-        selectedStickies.forEach((sid) => {
-          originalLocations[sid] = getStickyLocation(sid);
-        });
+        selectedStickies.forEach((sid) => {});
       } else {
         originalLocations[id] = getStickyLocation(id);

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:108:14
         selectedStickies.forEach((sid) => {
           originalLocations[sid] = getStickyLocation(sid);
         });
-      } else {
-        originalLocations[id] = getStickyLocation(id);
-      }
+      } else {}
       event.dataTransfer.setData(
         STICKY_TYPE,

[Survived] ObjectLiteral
put-it-up/scripts/board-items/sticky.js:113:56
       }
       event.dataTransfer.setData(
         STICKY_TYPE,
-        JSON.stringify({ originalLocations, dragStart: { x, y } })
+        JSON.stringify({ originalLocations, dragStart: {} })
       );
       moveToFront();

[Survived] ObjectLiteral
put-it-up/scripts/board-items/sticky.js:113:24
       }
       event.dataTransfer.setData(
         STICKY_TYPE,
-        JSON.stringify({ originalLocations, dragStart: { x, y } })
+        JSON.stringify({})
       );
       moveToFront();

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:117:35
       );
       moveToFront();
     };
-    function setEditable(enabled) {
-      if (enabled) {
-        container.classList.add("editing");
-        container.inputElement.focus();
-      } else {
-        container.classList.remove("editing");
-        container.inputElement.blur();
-      }
-    }
+    function setEditable(enabled) {}
     container.inputElement.onblur = () => setEditable(false);
     container.inputElement.onfocus = () => {

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:118:20
       moveToFront();
     };
     function setEditable(enabled) {
-      if (enabled) {
-        container.classList.add("editing");
-        container.inputElement.focus();
-      } else {
+      if (enabled) {} else {
         container.classList.remove("editing");
         container.inputElement.blur();

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:118:11
       moveToFront();
     };
     function setEditable(enabled) {
-      if (enabled) {
+      if (false) {
         container.classList.add("editing");
         container.inputElement.focus();

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:121:14
       if (enabled) {
         container.classList.add("editing");
         container.inputElement.focus();
-      } else {
-        container.classList.remove("editing");
-        container.inputElement.blur();
-      }
+      } else {}
     }
     container.inputElement.onblur = () => setEditable(false);

[Survived] BooleanLiteral
put-it-up/scripts/board-items/sticky.js:126:55
         container.inputElement.blur();
       }
     }
-    container.inputElement.onblur = () => setEditable(false);
+    container.inputElement.onblur = () => setEditable(true);
     container.inputElement.onfocus = () => {
       setEditable(true);

[Survived] ArrowFunction
put-it-up/scripts/board-items/sticky.js:126:37
         container.inputElement.blur();
       }
     }
-    container.inputElement.onblur = () => setEditable(false);
+    container.inputElement.onblur = () => undefined;
     container.inputElement.onfocus = () => {
       setEditable(true);

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:127:44
       }
     }
     container.inputElement.onblur = () => setEditable(false);
-    container.inputElement.onfocus = () => {
-      setEditable(true);
-      moveToFront();
-    };
+    container.inputElement.onfocus = () => {};
     container.inputElement.onkeydown = (event) => {
       event.stopPropagation();

[Survived] BooleanLiteral
put-it-up/scripts/board-items/sticky.js:128:19
     }
     container.inputElement.onblur = () => setEditable(false);
     container.inputElement.onfocus = () => {
-      setEditable(true);
+      setEditable(false);
       moveToFront();
     };

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:131:51
       setEditable(true);
       moveToFront();
     };
-    container.inputElement.onkeydown = (event) => {
-      event.stopPropagation();
-      if (event.key === "Escape") {
-        setEditable(false);
-      }
-    };
+    container.inputElement.onkeydown = (event) => {};
     container.inputElement.onkeyup = (event) => {
       event.stopPropagation();

[Survived] EqualityOperator
put-it-up/scripts/board-items/sticky.js:133:11
     };
     container.inputElement.onkeydown = (event) => {
       event.stopPropagation();
-      if (event.key === "Escape") {
+      if (event.key !== "Escape") {
         setEditable(false);
       }

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:133:35
     };
     container.inputElement.onkeydown = (event) => {
       event.stopPropagation();
-      if (event.key === "Escape") {
-        setEditable(false);
-      }
+      if (event.key === "Escape") {}
     };
     container.inputElement.onkeyup = (event) => {

[Survived] BooleanLiteral
put-it-up/scripts/board-items/sticky.js:134:21
     container.inputElement.onkeydown = (event) => {
       event.stopPropagation();
       if (event.key === "Escape") {
-        setEditable(false);
+        setEditable(true);
       }
     };

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:137:49
         setEditable(false);
       }
     };
-    container.inputElement.onkeyup = (event) => {
-      event.stopPropagation();
-      if (event.keyCode === 13) {
-        setEditable(false);
-      }
-    };
+    container.inputElement.onkeyup = (event) => {};
     container.inputElement.onclick = (event) => {
       if (event.shiftKey) {

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:139:33
     };
     container.inputElement.onkeyup = (event) => {
       event.stopPropagation();
-      if (event.keyCode === 13) {
-        setEditable(false);
-      }
+      if (event.keyCode === 13) {}
     };
     container.inputElement.onclick = (event) => {

[Survived] EqualityOperator
put-it-up/scripts/board-items/sticky.js:139:11
     };
     container.inputElement.onkeyup = (event) => {
       event.stopPropagation();
-      if (event.keyCode === 13) {
+      if (event.keyCode !== 13) {
         setEditable(false);
       }

[Survived] BooleanLiteral
put-it-up/scripts/board-items/sticky.js:140:21
     container.inputElement.onkeyup = (event) => {
       event.stopPropagation();
       if (event.keyCode === 13) {
-        setEditable(false);
+        setEditable(true);
       }
     };

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:143:49
         setEditable(false);
       }
     };
-    container.inputElement.onclick = (event) => {
-      if (event.shiftKey) {
-        event.preventDefault();
-      }
-    };
+    container.inputElement.onclick = (event) => {};
     function moveToFront() {
       [...container.parentNode.children].forEach((el) => {

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:144:11
       }
     };
     container.inputElement.onclick = (event) => {
-      if (event.shiftKey) {
+      if (true) {
         event.preventDefault();
       }

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:144:27
       }
     };
     container.inputElement.onclick = (event) => {
-      if (event.shiftKey) {
-        event.preventDefault();
-      }
+      if (event.shiftKey) {}
     };
     function moveToFront() {

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:148:28
         event.preventDefault();
       }
     };
-    function moveToFront() {
-      [...container.parentNode.children].forEach((el) => {
-        if (el === container) {
-          el.style.zIndex = "1";
-        } else {
-          el.style.zIndex = "unset";
-        }
-      });
-    }
+    function moveToFront() {}
     container.inputElement.addEventListener("input", () => {
       moveToFront();

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:149:58
       }
     };
     function moveToFront() {
-      [...container.parentNode.children].forEach((el) => {
-        if (el === container) {
-          el.style.zIndex = "1";
-        } else {
-          el.style.zIndex = "unset";
-        }
-      });
+      [...container.parentNode.children].forEach((el) => {});
     }
     container.inputElement.addEventListener("input", () => {

[Survived] ArrayDeclaration
put-it-up/scripts/board-items/sticky.js:149:7
       }
     };
     function moveToFront() {
-      [...container.parentNode.children].forEach((el) => {
+      [].forEach((el) => {
         if (el === container) {
           el.style.zIndex = "1";

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:150:13
     };
     function moveToFront() {
       [...container.parentNode.children].forEach((el) => {
-        if (el === container) {
+        if (false) {
           el.style.zIndex = "1";
         } else {

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:150:13
     };
     function moveToFront() {
       [...container.parentNode.children].forEach((el) => {
-        if (el === container) {
+        if (true) {
           el.style.zIndex = "1";
         } else {

[Survived] StringLiteral
put-it-up/scripts/board-items/sticky.js:151:29
     function moveToFront() {
       [...container.parentNode.children].forEach((el) => {
         if (el === container) {
-          el.style.zIndex = "1";
+          el.style.zIndex = "";
         } else {
           el.style.zIndex = "unset";

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:152:16
       [...container.parentNode.children].forEach((el) => {
         if (el === container) {
           el.style.zIndex = "1";
-        } else {
-          el.style.zIndex = "unset";
-        }
+        } else {}
       });
     }

[Survived] StringLiteral
put-it-up/scripts/board-items/sticky.js:153:29
         if (el === container) {
           el.style.zIndex = "1";
         } else {
-          el.style.zIndex = "unset";
+          el.style.zIndex = "";
         }
       });

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:157:60
         }
       });
     }
-    container.inputElement.addEventListener("input", () => {
-      moveToFront();
-      container.inputElement.value = updateTextById(
-        id,
-        container.inputElement.value
-      );
-      fitContentInSticky(container.sticky, container.inputElement);
-    });
+    container.inputElement.addEventListener("input", () => {});
     container.sticky.onclick = (event) => {
       moveToFront();

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:165:43
       );
       fitContentInSticky(container.sticky, container.inputElement);
     });
-    container.sticky.onclick = (event) => {
-      moveToFront();
-      if (event.shiftKey) {
-        selectedStickies.toggleSelected(id);
-        setEditable(false);
-      } else {
-        selectedStickies.replaceSelection(id);
-      }
-    };
+    container.sticky.onclick = (event) => {};
     moveToFront();
   }

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:167:11
     });
     container.sticky.onclick = (event) => {
       moveToFront();
-      if (event.shiftKey) {
+      if (true) {
         selectedStickies.toggleSelected(id);
         setEditable(false);

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:167:11
     });
     container.sticky.onclick = (event) => {
       moveToFront();
-      if (event.shiftKey) {
+      if (false) {
         selectedStickies.toggleSelected(id);
         setEditable(false);

[Survived] BooleanLiteral
put-it-up/scripts/board-items/sticky.js:169:21
       moveToFront();
       if (event.shiftKey) {
         selectedStickies.toggleSelected(id);
-        setEditable(false);
+        setEditable(true);
       } else {
         selectedStickies.replaceSelection(id);

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:170:14
       if (event.shiftKey) {
         selectedStickies.toggleSelected(id);
         setEditable(false);
-      } else {
-        selectedStickies.replaceSelection(id);
-      }
+      } else {}
     };
     moveToFront();

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:183:20
   textarea.style.fontSize = "1.5rem";
   let fontSize = 1.5;
   const wordMatches = textarea.value.match(/\S+/g);
-  const numWords = wordMatches === null ? 0 : wordMatches.length;
+  const numWords = false ? 0 : wordMatches.length;
   while (true) {
     let adjusted = false;

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:183:20
   textarea.style.fontSize = "1.5rem";
   let fontSize = 1.5;
   const wordMatches = textarea.value.match(/\S+/g);
-  const numWords = wordMatches === null ? 0 : wordMatches.length;
+  const numWords = true ? 0 : wordMatches.length;
   while (true) {
     let adjusted = false;

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:184:10
   let fontSize = 1.5;
   const wordMatches = textarea.value.match(/\S+/g);
   const numWords = wordMatches === null ? 0 : wordMatches.length;
-  while (true) {
+  while (false) {
     let adjusted = false;
     if (textarea.rows < numWords || textarea.value.length > 15) {

[Survived] BooleanLiteral
put-it-up/scripts/board-items/sticky.js:185:20
   const wordMatches = textarea.value.match(/\S+/g);
   const numWords = wordMatches === null ? 0 : wordMatches.length;
   while (true) {
-    let adjusted = false;
+    let adjusted = true;
     if (textarea.rows < numWords || textarea.value.length > 15) {
       if (

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:186:65
   const numWords = wordMatches === null ? 0 : wordMatches.length;
   while (true) {
     let adjusted = false;
-    if (textarea.rows < numWords || textarea.value.length > 15) {
-      if (
-        textarea.scrollHeight > textarea.clientHeight &&
-        sticky.scrollHeight <= sticky.clientHeight
-      ) {
-        textarea.rows++;
-        adjusted = true;
-      }
-      if (sticky.scrollHeight > sticky.clientHeight) {
-        textarea.rows--;
-        adjusted = false;
-      }
-    }
+    if (textarea.rows < numWords || textarea.value.length > 15) {}
     if (textarea.scrollHeight > textarea.clientHeight && fontSize > 0.5) {
       adjusted = true;

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:186:9
   const numWords = wordMatches === null ? 0 : wordMatches.length;
   while (true) {
     let adjusted = false;
-    if (textarea.rows < numWords || textarea.value.length > 15) {
+    if (false) {
       if (
         textarea.scrollHeight > textarea.clientHeight &&

[Survived] EqualityOperator
put-it-up/scripts/board-items/sticky.js:188:9
     let adjusted = false;
     if (textarea.rows < numWords || textarea.value.length > 15) {
       if (
-        textarea.scrollHeight > textarea.clientHeight &&
+        textarea.scrollHeight <= textarea.clientHeight &&
         sticky.scrollHeight <= sticky.clientHeight
       ) {

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:188:9
     let adjusted = false;
     if (textarea.rows < numWords || textarea.value.length > 15) {
       if (
-        textarea.scrollHeight > textarea.clientHeight &&
-        sticky.scrollHeight <= sticky.clientHeight
+        false
       ) {
         textarea.rows++;

[Survived] EqualityOperator
put-it-up/scripts/board-items/sticky.js:189:9
     if (textarea.rows < numWords || textarea.value.length > 15) {
       if (
         textarea.scrollHeight > textarea.clientHeight &&
-        sticky.scrollHeight <= sticky.clientHeight
+        sticky.scrollHeight > sticky.clientHeight
       ) {
         textarea.rows++;
