[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:189:9
     if (textarea.rows < numWords || textarea.value.length > 15) {
       if (
         textarea.scrollHeight > textarea.clientHeight &&
-        sticky.scrollHeight <= sticky.clientHeight
+        false
       ) {
         textarea.rows++;

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:190:9
       if (
         textarea.scrollHeight > textarea.clientHeight &&
         sticky.scrollHeight <= sticky.clientHeight
-      ) {
-        textarea.rows++;
-        adjusted = true;
-      }
+      ) {}
       if (sticky.scrollHeight > sticky.clientHeight) {
         textarea.rows--;

[Survived] UpdateOperator
put-it-up/scripts/board-items/sticky.js:191:9
         textarea.scrollHeight > textarea.clientHeight &&
         sticky.scrollHeight <= sticky.clientHeight
       ) {
-        textarea.rows++;
+        textarea.rows--;
         adjusted = true;
       }

[Survived] BooleanLiteral
put-it-up/scripts/board-items/sticky.js:192:20
         sticky.scrollHeight <= sticky.clientHeight
       ) {
         textarea.rows++;
-        adjusted = true;
+        adjusted = false;
       }
       if (sticky.scrollHeight > sticky.clientHeight) {

[Survived] EqualityOperator
put-it-up/scripts/board-items/sticky.js:194:11
         textarea.rows++;
         adjusted = true;
       }
-      if (sticky.scrollHeight > sticky.clientHeight) {
+      if (sticky.scrollHeight >= sticky.clientHeight) {
         textarea.rows--;
         adjusted = false;

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:194:54
         textarea.rows++;
         adjusted = true;
       }
-      if (sticky.scrollHeight > sticky.clientHeight) {
-        textarea.rows--;
-        adjusted = false;
-      }
+      if (sticky.scrollHeight > sticky.clientHeight) {}
     }
     if (textarea.scrollHeight > textarea.clientHeight && fontSize > 0.5) {

[Survived] UpdateOperator
put-it-up/scripts/board-items/sticky.js:195:9
         adjusted = true;
       }
       if (sticky.scrollHeight > sticky.clientHeight) {
-        textarea.rows--;
+        textarea.rows++;
         adjusted = false;
       }

[Survived] BooleanLiteral
put-it-up/scripts/board-items/sticky.js:196:20
       }
       if (sticky.scrollHeight > sticky.clientHeight) {
         textarea.rows--;
-        adjusted = false;
+        adjusted = true;
       }
     }

[Survived] EqualityOperator
put-it-up/scripts/board-items/sticky.js:199:58
         adjusted = false;
       }
     }
-    if (textarea.scrollHeight > textarea.clientHeight && fontSize > 0.5) {
+    if (textarea.scrollHeight > textarea.clientHeight && fontSize >= 0.5) {
       adjusted = true;
       fontSize -= 0.1;

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:199:58
         adjusted = false;
       }
     }
-    if (textarea.scrollHeight > textarea.clientHeight && fontSize > 0.5) {
+    if (textarea.scrollHeight > textarea.clientHeight && true) {
       adjusted = true;
       fontSize -= 0.1;

[Survived] BooleanLiteral
put-it-up/scripts/board-items/sticky.js:200:18
       }
     }
     if (textarea.scrollHeight > textarea.clientHeight && fontSize > 0.5) {
-      adjusted = true;
+      adjusted = false;
       fontSize -= 0.1;
       textarea.style.fontSize = fontSize + "rem";

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:204:9
       fontSize -= 0.1;
       textarea.style.fontSize = fontSize + "rem";
     }
-    if (!adjusted) {
+    if (true) {
       break;
     }

[Survived] BooleanLiteral
put-it-up/scripts/board-items/sticky.js:204:9
       fontSize -= 0.1;
       textarea.style.fontSize = fontSize + "rem";
     }
-    if (!adjusted) {
+    if (adjusted) {
       break;
     }

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:216:3
   animateMove,
   stickyIsSelected,
   origin
-) {
-  const { sticky: stickyElement } = container;
-  if (animateMove) {
-    container.classList.add("animate-move");
-  } else {
-    container.classList.remove("animate-move");
-  }
-  container.style.left = sticky.location.x - origin.x + "px";
-  container.style.top = sticky.location.y - origin.y + "px";
-  if (stickyIsSelected) {
-    container.classList.add("selected");
-    container.style.backgroundColor = "";
-  } else {
-    container.classList.remove("selected");
-  }
-  const size = 100 + "px";
-  container.style.width = size;
-  container.style.height = size;
-  stickyElement.style.backgroundColor = sticky.color || DEFAULT_STICKY_COLOR;
-}
+) {}
 
 function createStickyContainerDOM(stickyIdClass) {

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:218:7
   origin
 ) {
   const { sticky: stickyElement } = container;
-  if (animateMove) {
+  if (true) {
     container.classList.add("animate-move");
   } else {

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:218:20
   origin
 ) {
   const { sticky: stickyElement } = container;
-  if (animateMove) {
-    container.classList.add("animate-move");
-  } else {
+  if (animateMove) {} else {
     container.classList.remove("animate-move");
   }

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:220:10
   const { sticky: stickyElement } = container;
   if (animateMove) {
     container.classList.add("animate-move");
-  } else {
-    container.classList.remove("animate-move");
-  }
+  } else {}
   container.style.left = sticky.location.x - origin.x + "px";
   container.style.top = sticky.location.y - origin.y + "px";

[Survived] ArithmeticOperator
put-it-up/scripts/board-items/sticky.js:223:26
   } else {
     container.classList.remove("animate-move");
   }
-  container.style.left = sticky.location.x - origin.x + "px";
+  container.style.left = sticky.location.x + origin.x + "px";
   container.style.top = sticky.location.y - origin.y + "px";
   if (stickyIsSelected) {

[Survived] StringLiteral
put-it-up/scripts/board-items/sticky.js:223:57
   } else {
     container.classList.remove("animate-move");
   }
-  container.style.left = sticky.location.x - origin.x + "px";
+  container.style.left = sticky.location.x - origin.x + "";
   container.style.top = sticky.location.y - origin.y + "px";
   if (stickyIsSelected) {

[Survived] ArithmeticOperator
put-it-up/scripts/board-items/sticky.js:224:25
     container.classList.remove("animate-move");
   }
   container.style.left = sticky.location.x - origin.x + "px";
-  container.style.top = sticky.location.y - origin.y + "px";
+  container.style.top = sticky.location.y + origin.y + "px";
   if (stickyIsSelected) {
     container.classList.add("selected");

[Survived] StringLiteral
put-it-up/scripts/board-items/sticky.js:224:56
     container.classList.remove("animate-move");
   }
   container.style.left = sticky.location.x - origin.x + "px";
-  container.style.top = sticky.location.y - origin.y + "px";
+  container.style.top = sticky.location.y - origin.y + "";
   if (stickyIsSelected) {
     container.classList.add("selected");

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:225:25
   }
   container.style.left = sticky.location.x - origin.x + "px";
   container.style.top = sticky.location.y - origin.y + "px";
-  if (stickyIsSelected) {
-    container.classList.add("selected");
-    container.style.backgroundColor = "";
-  } else {
+  if (stickyIsSelected) {} else {
     container.classList.remove("selected");
   }

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:225:7
   }
   container.style.left = sticky.location.x - origin.x + "px";
   container.style.top = sticky.location.y - origin.y + "px";
-  if (stickyIsSelected) {
+  if (false) {
     container.classList.add("selected");
     container.style.backgroundColor = "";

[Survived] StringLiteral
put-it-up/scripts/board-items/sticky.js:226:29
   container.style.left = sticky.location.x - origin.x + "px";
   container.style.top = sticky.location.y - origin.y + "px";
   if (stickyIsSelected) {
-    container.classList.add("selected");
+    container.classList.add("");
     container.style.backgroundColor = "";
   } else {

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:228:10
   if (stickyIsSelected) {
     container.classList.add("selected");
     container.style.backgroundColor = "";
-  } else {
-    container.classList.remove("selected");
-  }
+  } else {}
   const size = 100 + "px";
   container.style.width = size;

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:234:41
   const size = 100 + "px";
   container.style.width = size;
   container.style.height = size;
-  stickyElement.style.backgroundColor = sticky.color || DEFAULT_STICKY_COLOR;
+  stickyElement.style.backgroundColor = false;
 }
 

[Survived] ConditionalExpression
put-it-up/scripts/board-items/sticky.js:234:41
   const size = 100 + "px";
   container.style.width = size;
   container.style.height = size;
-  stickyElement.style.backgroundColor = sticky.color || DEFAULT_STICKY_COLOR;
+  stickyElement.style.backgroundColor = true;
 }
 

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:237:50
   stickyElement.style.backgroundColor = sticky.color || DEFAULT_STICKY_COLOR;
 }
 
-function createStickyContainerDOM(stickyIdClass) {
-  const container = document.createElement("div");
-  container.innerHTML =
-    '<div class="sticky"><textarea class="text-input text" rows="1"></textarea></div>';
-  container.classList.add(stickyIdClass);
-  container.inputElement = container.querySelector(".text-input");
-  container.sticky = container.querySelector(".sticky");
-  container.classList.add("sticky-container");
-  container.sticky.setAttribute("draggable", "true");
-  return container;
-}
+function createStickyContainerDOM(stickyIdClass) {}
 
 function removePx(s) {

[Survived] StringLiteral
put-it-up/scripts/board-items/sticky.js:242:52
   container.innerHTML =
     '<div class="sticky"><textarea class="text-input text" rows="1"></textarea></div>';
   container.classList.add(stickyIdClass);
-  container.inputElement = container.querySelector(".text-input");
+  container.inputElement = container.querySelector("");
   container.sticky = container.querySelector(".sticky");
   container.classList.add("sticky-container");

[Survived] StringLiteral
put-it-up/scripts/board-items/sticky.js:243:46
     '<div class="sticky"><textarea class="text-input text" rows="1"></textarea></div>';
   container.classList.add(stickyIdClass);
   container.inputElement = container.querySelector(".text-input");
-  container.sticky = container.querySelector(".sticky");
+  container.sticky = container.querySelector("");
   container.classList.add("sticky-container");
   container.sticky.setAttribute("draggable", "true");

[Survived] BlockStatement
put-it-up/scripts/board-items/sticky.js:249:22
   return container;
 }
 
-function removePx(s) {
-  return +s.substring(0, s.length - 2);
-}
+function removePx(s) {}
 

[Survived] ArithmeticOperator
put-it-up/scripts/board-items/sticky.js:250:26
 }
 
 function removePx(s) {
-  return +s.substring(0, s.length - 2);
+  return +s.substring(0, s.length + 2);
 }
 

[Survived] UnaryOperator
put-it-up/scripts/board-items/sticky.js:250:10
 }
 
 function removePx(s) {
-  return +s.substring(0, s.length - 2);
+  return -s.substring(0, s.length - 2);
 }
 
