[Killed] ObjectLiteral
put-it-up/scripts/board/board.js:1:23
-const DEFAULT_BOARD = {
-  origin: { x: 0, y: 0 },
-  limit: { x: 2400, y: 1350 },
-};
+const DEFAULT_BOARD = {};
 
 export function Board(aStore) {

[Killed] ObjectLiteral
put-it-up/scripts/board/board.js:2:11
 const DEFAULT_BOARD = {
-  origin: { x: 0, y: 0 },
+  origin: {},
   limit: { x: 2400, y: 1350 },
 };

[Killed] ObjectLiteral
put-it-up/scripts/board/board.js:3:10
 const DEFAULT_BOARD = {
   origin: { x: 0, y: 0 },
-  limit: { x: 2400, y: 1350 },
+  limit: {},
 };
 

[Killed] ArrowFunction
put-it-up/scripts/board/board.js:11:26
   let gridSize = 25;
   const sizeIncrements = { x: 100, y: 100 };
 
-  const removeNewlines = (text) => text.replace(/\n/g, "");
+  const removeNewlines = () => undefined;
 
   const getBoardInternal = () => {

[Killed] BlockStatement
put-it-up/scripts/board/board.js:13:34
 
   const removeNewlines = (text) => text.replace(/\n/g, "");
 
-  const getBoardInternal = () => {
-    let { origin, limit } = store.getBoard(DEFAULT_BOARD);
-    return { origin, limit };
-  };
+  const getBoardInternal = () => {};
 
   this.isReadyForUse = () => store.isReadyForUse();

[Survived] ArrowFunction
put-it-up/scripts/board/board.js:18:24
     return { origin, limit };
   };
 
-  this.isReadyForUse = () => store.isReadyForUse();
+  this.isReadyForUse = () => undefined;
 
   this.getSticky = (id) => store.getSticky(id);

[Killed] ArrowFunction
put-it-up/scripts/board/board.js:20:20
 
   this.isReadyForUse = () => store.isReadyForUse();
 
-  this.getSticky = (id) => store.getSticky(id);
+  this.getSticky = () => undefined;
 
   this.getStickySafe = (id) => {

[Survived] BlockStatement
put-it-up/scripts/board/board.js:22:32
 
   this.getSticky = (id) => store.getSticky(id);
 
-  this.getStickySafe = (id) => {
-    let sticky;
-    try {
-      sticky = this.getSticky(id);
-    } catch (e) {}
-    return sticky;
-  };
+  this.getStickySafe = (id) => {};
 
   this.putSticky = (sticky) => {

[Survived] BlockStatement
put-it-up/scripts/board/board.js:24:9
 
   this.getStickySafe = (id) => {
     let sticky;
-    try {
-      sticky = this.getSticky(id);
-    } catch (e) {}
+    try {} catch (e) {}
     return sticky;
   };

[Killed] BlockStatement
put-it-up/scripts/board/board.js:30:32
     return sticky;
   };
 
-  this.putSticky = (sticky) => {
-    const { origin, limit } = getBoardInternal();
-    sticky.text = sticky.text || "";
-    sticky.text = removeNewlines(sticky.text);
-    sticky.location = snapLocation(
-      sticky.location || { x: 0, y: 0 },
-      gridSize,
-      origin,
-      limit
-    );
-    const id = store.createSticky(sticky);
-    return id;
-  };
+  this.putSticky = (sticky) => {};
 
   this.deleteSticky = (id) => {

[Killed] ConditionalExpression
put-it-up/scripts/board/board.js:32:19
 
   this.putSticky = (sticky) => {
     const { origin, limit } = getBoardInternal();
-    sticky.text = sticky.text || "";
+    sticky.text = false;
     sticky.text = removeNewlines(sticky.text);
     sticky.location = snapLocation(

[Killed] LogicalOperator
put-it-up/scripts/board/board.js:32:19
 
   this.putSticky = (sticky) => {
     const { origin, limit } = getBoardInternal();
-    sticky.text = sticky.text || "";
+    sticky.text = sticky.text && "";
     sticky.text = removeNewlines(sticky.text);
     sticky.location = snapLocation(

[Killed] ConditionalExpression
put-it-up/scripts/board/board.js:35:7
     sticky.text = sticky.text || "";
     sticky.text = removeNewlines(sticky.text);
     sticky.location = snapLocation(
-      sticky.location || { x: 0, y: 0 },
+      true,
       gridSize,
       origin,

[Killed] LogicalOperator
put-it-up/scripts/board/board.js:35:7
     sticky.text = sticky.text || "";
     sticky.text = removeNewlines(sticky.text);
     sticky.location = snapLocation(
-      sticky.location || { x: 0, y: 0 },
+      sticky.location && {
+  x: 0,
+  y: 0
+},
       gridSize,
       origin,

[Survived] BlockStatement
put-it-up/scripts/board/board.js:44:31
     return id;
   };
 
-  this.deleteSticky = (id) => {
-    store.deleteSticky(id);
-  };
+  this.deleteSticky = (id) => {};
 
   this.updateText = (id, text) => {

[Killed] BlockStatement
put-it-up/scripts/board/board.js:48:35
     store.deleteSticky(id);
   };
 
-  this.updateText = (id, text) => {
-    text = text || "";
-    text = removeNewlines(text);
-    store.updateText(id, text);
-    return text;
-  };
+  this.updateText = (id, text) => {};
 
   this.changeSize = (isGrow, side) => {

[Killed] LogicalOperator
put-it-up/scripts/board/board.js:49:12
   };
 
   this.updateText = (id, text) => {
-    text = text || "";
+    text = text && "";
     text = removeNewlines(text);
     store.updateText(id, text);

[Killed] ConditionalExpression
put-it-up/scripts/board/board.js:49:12
   };
 
   this.updateText = (id, text) => {
-    text = text || "";
+    text = true;
     text = removeNewlines(text);
     store.updateText(id, text);

[Killed] BlockStatement
put-it-up/scripts/board/board.js:55:39
     return text;
   };
 
-  this.changeSize = (isGrow, side) => {
-    const { origin, limit } = getBoardInternal();
-    const factor = isGrow ? 1 : -1;
-    switch (side) {
-      case "top":
-        origin.y += sizeIncrements.y * -factor;
-        break;
-      case "bottom":
-        limit.y += sizeIncrements.y * factor;
-        break;
-      case "left":
-        origin.x += sizeIncrements.x * -factor;
-        break;
-      case "right":
-        limit.x += sizeIncrements.x * factor;
-      default:
-        break;
-    }
-    this.moveInBounds({ origin, limit });
-    store.updateBoard({
-      origin,
-      limit,
-    });
-  };
+  this.changeSize = (isGrow, side) => {};
 
   this.updateColor = (id, color) => {

[Killed] UnaryOperator
put-it-up/scripts/board/board.js:57:33
 
   this.changeSize = (isGrow, side) => {
     const { origin, limit } = getBoardInternal();
-    const factor = isGrow ? 1 : -1;
+    const factor = isGrow ? 1 : +1;
     switch (side) {
       case "top":

[Killed] ConditionalExpression
put-it-up/scripts/board/board.js:59:7
     const { origin, limit } = getBoardInternal();
     const factor = isGrow ? 1 : -1;
     switch (side) {
-      case "top":
-        origin.y += sizeIncrements.y * -factor;
-        break;
+      case "top":
       case "bottom":
         limit.y += sizeIncrements.y * factor;

[Killed] UnaryOperator
put-it-up/scripts/board/board.js:60:40
     const factor = isGrow ? 1 : -1;
     switch (side) {
       case "top":
-        origin.y += sizeIncrements.y * -factor;
+        origin.y += sizeIncrements.y * +factor;
         break;
       case "bottom":

[Survived] ArithmeticOperator
put-it-up/scripts/board/board.js:60:21
     const factor = isGrow ? 1 : -1;
     switch (side) {
       case "top":
-        origin.y += sizeIncrements.y * -factor;
+        origin.y += sizeIncrements.y / -factor;
         break;
       case "bottom":

[Killed] ConditionalExpression
put-it-up/scripts/board/board.js:62:7
       case "top":
         origin.y += sizeIncrements.y * -factor;
         break;
-      case "bottom":
-        limit.y += sizeIncrements.y * factor;
-        break;
+      case "bottom":
       case "left":
         origin.x += sizeIncrements.x * -factor;

[Survived] ArithmeticOperator
put-it-up/scripts/board/board.js:63:20
         origin.y += sizeIncrements.y * -factor;
         break;
       case "bottom":
-        limit.y += sizeIncrements.y * factor;
+        limit.y += sizeIncrements.y / factor;
         break;
       case "left":

[Killed] ConditionalExpression
put-it-up/scripts/board/board.js:65:7
       case "bottom":
         limit.y += sizeIncrements.y * factor;
         break;
-      case "left":
-        origin.x += sizeIncrements.x * -factor;
-        break;
+      case "left":
       case "right":
         limit.x += sizeIncrements.x * factor;

[Killed] UnaryOperator
put-it-up/scripts/board/board.js:66:40
         limit.y += sizeIncrements.y * factor;
         break;
       case "left":
-        origin.x += sizeIncrements.x * -factor;
+        origin.x += sizeIncrements.x * +factor;
         break;
       case "right":

[Survived] ArithmeticOperator
put-it-up/scripts/board/board.js:66:21
         limit.y += sizeIncrements.y * factor;
         break;
       case "left":
-        origin.x += sizeIncrements.x * -factor;
+        origin.x += sizeIncrements.x / -factor;
         break;
       case "right":

[Killed] ConditionalExpression
put-it-up/scripts/board/board.js:68:7
       case "left":
         origin.x += sizeIncrements.x * -factor;
         break;
-      case "right":
-        limit.x += sizeIncrements.x * factor;
+      case "right":
       default:
         break;

[Survived] ArithmeticOperator
put-it-up/scripts/board/board.js:69:20
         origin.x += sizeIncrements.x * -factor;
         break;
       case "right":
-        limit.x += sizeIncrements.x * factor;
+        limit.x += sizeIncrements.x / factor;
       default:
         break;

[Survived] ConditionalExpression
put-it-up/scripts/board/board.js:70:7
         break;
       case "right":
         limit.x += sizeIncrements.x * factor;
-      default:
-        break;
+      default:
     }
     this.moveInBounds({ origin, limit });

[Killed] ObjectLiteral
put-it-up/scripts/board/board.js:74:23
         break;
     }
     this.moveInBounds({ origin, limit });
-    store.updateBoard({
-      origin,
-      limit,
-    });
+    store.updateBoard({});
   };
 

[Survived] BlockStatement
put-it-up/scripts/board/board.js:80:37
     });
   };
 
-  this.updateColor = (id, color) => {
-    store.updateColor(id, color);
-  };
+  this.updateColor = (id, color) => {};
 
   this.getStickyLocation = (id) => {

[Killed] BlockStatement
put-it-up/scripts/board/board.js:84:36
     store.updateColor(id, color);
   };
 
-  this.getStickyLocation = (id) => {
-    return store.getSticky(id).location;
-  };
+  this.getStickyLocation = (id) => {};
 
   this.moveSticky = (id, newLocation) => {

[Killed] BlockStatement
put-it-up/scripts/board/board.js:88:42
     return store.getSticky(id).location;
   };
 
-  this.moveSticky = (id, newLocation) => {
-    const { origin, limit } = getBoardInternal();
-    newLocation = snapLocation(
-      newLocation || { x: 0, y: 0 },
-      gridSize,
-      origin,
-      limit
-    );
-    store.setLocation(id, newLocation);
-  };
+  this.moveSticky = (id, newLocation) => {};
 
   this.getState = () => store.getState();

[Survived] ConditionalExpression
put-it-up/scripts/board/board.js:91:7
   this.moveSticky = (id, newLocation) => {
     const { origin, limit } = getBoardInternal();
     newLocation = snapLocation(
-      newLocation || { x: 0, y: 0 },
+      true,
       gridSize,
       origin,

[Survived] LogicalOperator
put-it-up/scripts/board/board.js:91:7
   this.moveSticky = (id, newLocation) => {
     const { origin, limit } = getBoardInternal();
     newLocation = snapLocation(
-      newLocation || { x: 0, y: 0 },
+      newLocation && {
+  x: 0,
+  y: 0
+},
       gridSize,
       origin,

[Survived] ArrowFunction
put-it-up/scripts/board/board.js:99:19
     store.setLocation(id, newLocation);
   };
 
-  this.getState = () => store.getState();
+  this.getState = () => undefined;
 
   this.setState = (state) => {

[Survived] BlockStatement
put-it-up/scripts/board/board.js:101:30
 
   this.getState = () => store.getState();
 
-  this.setState = (state) => {
-    store.setState(state);
-  };
+  this.setState = (state) => {};
 
   this.getStickyBaseSize = () => 100;

[Survived] ArrowFunction
put-it-up/scripts/board/board.js:105:28
     store.setState(state);
   };
 
-  this.getStickyBaseSize = () => 100;
+  this.getStickyBaseSize = () => undefined;
   this.getGridUnit = () => gridSize;
   this.getBoardSize = () => {

[Survived] ArrowFunction
put-it-up/scripts/board/board.js:106:22
   };
 
   this.getStickyBaseSize = () => 100;
-  this.getGridUnit = () => gridSize;
+  this.getGridUnit = () => undefined;
   this.getBoardSize = () => {
     const { origin, limit } = getBoardInternal();

[Killed] BlockStatement
put-it-up/scripts/board/board.js:107:29
 
   this.getStickyBaseSize = () => 100;
   this.getGridUnit = () => gridSize;
-  this.getBoardSize = () => {
-    const { origin, limit } = getBoardInternal();
-    return {
-      width: limit.x - origin.x,
-      height: limit.y - origin.y,
-    };
-  };
+  this.getBoardSize = () => {};
 
   this.getOrigin = () => {

[Killed] ArithmeticOperator
put-it-up/scripts/board/board.js:110:14
   this.getBoardSize = () => {
     const { origin, limit } = getBoardInternal();
     return {
-      width: limit.x - origin.x,
+      width: limit.x + origin.x,
       height: limit.y - origin.y,
     };

[Killed] ArithmeticOperator
put-it-up/scripts/board/board.js:111:15
     const { origin, limit } = getBoardInternal();
     return {
       width: limit.x - origin.x,
-      height: limit.y - origin.y,
+      height: limit.y + origin.y,
     };
   };

[Survived] BlockStatement
put-it-up/scripts/board/board.js:115:26
     };
   };
 
-  this.getOrigin = () => {
-    const { origin } = getBoardInternal();
-    return { x: origin.x, y: origin.y };
-  };
+  this.getOrigin = () => {};
 
   this.addObserver = store.addObserver;

[Killed] BlockStatement
put-it-up/scripts/board/board.js:122:46
 
   this.addObserver = store.addObserver;
 
-  this.moveInBounds = ({ origin, limit }) => {
-    Object.entries(store.stickies).forEach(([id, sticky]) => {
-      const oldLocation = sticky.location;
-      const newLocation = snapLocation(oldLocation, gridSize, origin, limit);
-      let outOfBounds =
-        oldLocation.x != newLocation.x || oldLocation.y != newLocation.y;
-      if (outOfBounds) {
-        store.setLocation(id, newLocation);
-      }
-    });
-  };
+  this.moveInBounds = ({ origin, limit }) => {};
 }
 

[Killed] BlockStatement
put-it-up/scripts/board/board.js:123:62
   this.addObserver = store.addObserver;
 
   this.moveInBounds = ({ origin, limit }) => {
-    Object.entries(store.stickies).forEach(([id, sticky]) => {
-      const oldLocation = sticky.location;
-      const newLocation = snapLocation(oldLocation, gridSize, origin, limit);
-      let outOfBounds =
-        oldLocation.x != newLocation.x || oldLocation.y != newLocation.y;
-      if (outOfBounds) {
-        store.setLocation(id, newLocation);
-      }
-    });
+    Object.entries(store.stickies).forEach(([id, sticky]) => {});
   };
 }

[Killed] ConditionalExpression
put-it-up/scripts/board/board.js:127:9
       const oldLocation = sticky.location;
       const newLocation = snapLocation(oldLocation, gridSize, origin, limit);
       let outOfBounds =
-        oldLocation.x != newLocation.x || oldLocation.y != newLocation.y;
+        false;
       if (outOfBounds) {
         store.setLocation(id, newLocation);

[Killed] ConditionalExpression
put-it-up/scripts/board/board.js:127:9
       const oldLocation = sticky.location;
       const newLocation = snapLocation(oldLocation, gridSize, origin, limit);
       let outOfBounds =
-        oldLocation.x != newLocation.x || oldLocation.y != newLocation.y;
+        false || oldLocation.y != newLocation.y;
       if (outOfBounds) {
         store.setLocation(id, newLocation);

[Killed] BlockStatement
put-it-up/scripts/board/board.js:128:24
       const newLocation = snapLocation(oldLocation, gridSize, origin, limit);
       let outOfBounds =
         oldLocation.x != newLocation.x || oldLocation.y != newLocation.y;
-      if (outOfBounds) {
-        store.setLocation(id, newLocation);
-      }
+      if (outOfBounds) {}
     });
   };

[Killed] ConditionalExpression
put-it-up/scripts/board/board.js:128:11
       const newLocation = snapLocation(oldLocation, gridSize, origin, limit);
       let outOfBounds =
         oldLocation.x != newLocation.x || oldLocation.y != newLocation.y;
-      if (outOfBounds) {
+      if (false) {
         store.setLocation(id, newLocation);
       }

[Killed] BlockStatement
put-it-up/scripts/board/board.js:135:37
   };
 }
 
-function snapDimension(x, gridSize) {
-  const remainder = x % gridSize;
-  x -= remainder;
-  if (remainder > gridSize / 2) {
-    x += gridSize;
-  }
-  return x;
-}
+function snapDimension(x, gridSize) {}
 
 function snapLocation(location, gridSize, origin, limit) {

[Killed] ArithmeticOperator
put-it-up/scripts/board/board.js:136:21
 }
 
 function snapDimension(x, gridSize) {
-  const remainder = x % gridSize;
+  const remainder = x * gridSize;
   x -= remainder;
   if (remainder > gridSize / 2) {

[Killed] BlockStatement
put-it-up/scripts/board/board.js:138:33
 function snapDimension(x, gridSize) {
   const remainder = x % gridSize;
   x -= remainder;
-  if (remainder > gridSize / 2) {
-    x += gridSize;
-  }
+  if (remainder > gridSize / 2) {}
   return x;
 }

[Killed] ConditionalExpression
put-it-up/scripts/board/board.js:138:7
 function snapDimension(x, gridSize) {
   const remainder = x % gridSize;
   x -= remainder;
-  if (remainder > gridSize / 2) {
+  if (false) {
     x += gridSize;
   }

[Killed] BlockStatement
put-it-up/scripts/board/board.js:144:58
   return x;
 }
 
-function snapLocation(location, gridSize, origin, limit) {
-  return {
-    x: Math.min(
-      limit.x - 100,
-      Math.max(origin.x, snapDimension(Math.floor(location.x), gridSize))
-    ),
-    y: Math.min(
-      limit.y - 100,
-      Math.max(origin.y, snapDimension(Math.floor(location.y), gridSize))
-    ),
-  };
-}
+function snapLocation(location, gridSize, origin, limit) {}
 

[Killed] ObjectLiteral
put-it-up/scripts/board/board.js:145:10
 }
 
 function snapLocation(location, gridSize, origin, limit) {
-  return {
-    x: Math.min(
-      limit.x - 100,
-      Math.max(origin.x, snapDimension(Math.floor(location.x), gridSize))
-    ),
-    y: Math.min(
-      limit.y - 100,
-      Math.max(origin.y, snapDimension(Math.floor(location.y), gridSize))
-    ),
-  };
+  return {};
 }
 

[Killed] ArithmeticOperator
put-it-up/scripts/board/board.js:147:7
 function snapLocation(location, gridSize, origin, limit) {
   return {
     x: Math.min(
-      limit.x - 100,
+      limit.x + 100,
       Math.max(origin.x, snapDimension(Math.floor(location.x), gridSize))
     ),

[Killed] ArithmeticOperator
put-it-up/scripts/board/board.js:151:7
       Math.max(origin.x, snapDimension(Math.floor(location.x), gridSize))
     ),
     y: Math.min(
-      limit.y - 100,
+      limit.y + 100,
       Math.max(origin.y, snapDimension(Math.floor(location.y), gridSize))
     ),
