[Survived] BooleanLiteral
put-it-up/scripts/board/local-datastore.js:7:25
   idGen = 0;
   observers = [];
 
-  isReadyForUse = () => true;
+  isReadyForUse = () => false;
 
   getBoard = (defaults) => {

[Survived] ArrowFunction
put-it-up/scripts/board/local-datastore.js:7:19
   idGen = 0;
   observers = [];
 
-  isReadyForUse = () => true;
+  isReadyForUse = () => undefined;
 
   getBoard = (defaults) => {

[Killed] BlockStatement
put-it-up/scripts/board/local-datastore.js:9:28
 
   isReadyForUse = () => true;
 
-  getBoard = (defaults) => {
-    this.board = this.board || defaults;
-    return clone(this.board);
-  };
+  getBoard = (defaults) => {};
 
   getSticky = (id) => {

[Killed] ConditionalExpression
put-it-up/scripts/board/local-datastore.js:10:18
   isReadyForUse = () => true;
 
   getBoard = (defaults) => {
-    this.board = this.board || defaults;
+    this.board = false;
     return clone(this.board);
   };

[Killed] LogicalOperator
put-it-up/scripts/board/local-datastore.js:10:18
   isReadyForUse = () => true;
 
   getBoard = (defaults) => {
-    this.board = this.board || defaults;
+    this.board = this.board && defaults;
     return clone(this.board);
   };

[Killed] BlockStatement
put-it-up/scripts/board/local-datastore.js:14:23
     return clone(this.board);
   };
 
-  getSticky = (id) => {
-    const sticky = this.stickies[id];
-    if (!sticky) {
-      throw new Error("No such sticky id=" + id);
-    }
-    return sticky;
-  };
+  getSticky = (id) => {};
 
   createSticky = (sticky) => {

[Killed] BlockStatement
put-it-up/scripts/board/local-datastore.js:16:18
 
   getSticky = (id) => {
     const sticky = this.stickies[id];
-    if (!sticky) {
-      throw new Error("No such sticky id=" + id);
-    }
+    if (!sticky) {}
     return sticky;
   };

[Killed] ConditionalExpression
put-it-up/scripts/board/local-datastore.js:16:9
 
   getSticky = (id) => {
     const sticky = this.stickies[id];
-    if (!sticky) {
+    if (true) {
       throw new Error("No such sticky id=" + id);
     }

[Killed] BlockStatement
put-it-up/scripts/board/local-datastore.js:22:30
     return sticky;
   };
 
-  createSticky = (sticky) => {
-    this.stickies[++this.idGen] = sticky;
-    this.notifyStickyChange(this.idGen);
-    return this.idGen;
-  };
+  createSticky = (sticky) => {};
 
   deleteSticky = (id) => {

[Survived] UpdateOperator
put-it-up/scripts/board/local-datastore.js:23:19
   };
 
   createSticky = (sticky) => {
-    this.stickies[++this.idGen] = sticky;
+    this.stickies[--this.idGen] = sticky;
     this.notifyStickyChange(this.idGen);
     return this.idGen;

[Survived] BlockStatement
put-it-up/scripts/board/local-datastore.js:28:26
     return this.idGen;
   };
 
-  deleteSticky = (id) => {
-    delete this.stickies[id];
-    this.notifyStickyChange(id);
-  };
+  deleteSticky = (id) => {};
 
   updateText = (id, text) => {

[Killed] BlockStatement
put-it-up/scripts/board/local-datastore.js:33:30
     this.notifyStickyChange(id);
   };
 
-  updateText = (id, text) => {
-    this.getSticky(id).text = text;
-    this.notifyStickyChange(id);
-  };
+  updateText = (id, text) => {};
 
   updateColor = (id, color) => {

[Survived] BlockStatement
put-it-up/scripts/board/local-datastore.js:38:32
     this.notifyStickyChange(id);
   };
 
-  updateColor = (id, color) => {
-    this.getSticky(id).color = color;
-    this.notifyStickyChange(id);
-  };
+  updateColor = (id, color) => {};
 
   setLocation = (id, location) => {

[Killed] BlockStatement
put-it-up/scripts/board/local-datastore.js:43:35
     this.notifyStickyChange(id);
   };
 
-  setLocation = (id, location) => {
-    this.getSticky(id).location = location;
-    this.notifyStickyChange(id);
-  };
+  setLocation = (id, location) => {};
 
   updateBoard = (board) => {

[Killed] BlockStatement
put-it-up/scripts/board/local-datastore.js:48:28
     this.notifyStickyChange(id);
   };
 
-  updateBoard = (board) => {
-    Object.assign(this.board, board);
-    this.notifyBoardChange();
-  };
+  updateBoard = (board) => {};
 
   connect() {}

[Survived] ArrowFunction
put-it-up/scripts/board/local-datastore.js:55:14
 
   connect() {}
 
-  getState = () => clone({ stickies: this.stickies, idGen: this.idGen });
+  getState = () => undefined;
 
   setState = (state) => {

[Survived] ObjectLiteral
put-it-up/scripts/board/local-datastore.js:55:26
 
   connect() {}
 
-  getState = () => clone({ stickies: this.stickies, idGen: this.idGen });
+  getState = () => clone({});
 
   setState = (state) => {

[Survived] BlockStatement
put-it-up/scripts/board/local-datastore.js:57:25
 
   getState = () => clone({ stickies: this.stickies, idGen: this.idGen });
 
-  setState = (state) => {
-    this.stickies = state.stickies;
-    this.idGen = state.idGen;
-    this.notifyBoardChange();
-  };
+  setState = (state) => {};
 
   notifyStickyChange = (id) => {

[Survived] BlockStatement
put-it-up/scripts/board/local-datastore.js:63:32
     this.notifyBoardChange();
   };
 
-  notifyStickyChange = (id) => {
-    this.observers.forEach((o) => o.onStickyChange(id));
-  };
+  notifyStickyChange = (id) => {};
   notifyBoardChange = () => {
     this.observers.forEach((o) => o.onBoardChange());

[Survived] ArrowFunction
put-it-up/scripts/board/local-datastore.js:64:28
   };
 
   notifyStickyChange = (id) => {
-    this.observers.forEach((o) => o.onStickyChange(id));
+    this.observers.forEach(() => undefined);
   };
   notifyBoardChange = () => {

[Survived] BlockStatement
put-it-up/scripts/board/local-datastore.js:66:29
   notifyStickyChange = (id) => {
     this.observers.forEach((o) => o.onStickyChange(id));
   };
-  notifyBoardChange = () => {
-    this.observers.forEach((o) => o.onBoardChange());
-  };
+  notifyBoardChange = () => {};
   addObserver = (observer) => {
     this.observers.push(observer);

[Survived] ArrowFunction
put-it-up/scripts/board/local-datastore.js:67:28
     this.observers.forEach((o) => o.onStickyChange(id));
   };
   notifyBoardChange = () => {
-    this.observers.forEach((o) => o.onBoardChange());
+    this.observers.forEach(() => undefined);
   };
   addObserver = (observer) => {

[Survived] BlockStatement
put-it-up/scripts/board/local-datastore.js:69:31
   notifyBoardChange = () => {
     this.observers.forEach((o) => o.onBoardChange());
   };
-  addObserver = (observer) => {
-    this.observers.push(observer);
-  };
+  addObserver = (observer) => {};
 }
 

[Killed] BlockStatement
put-it-up/scripts/board/local-datastore.js:74:22
   };
 }
 
-function clone(data) {
-  return JSON.parse(JSON.stringify(data));
-}
+function clone(data) {}
 
