[Survived] BooleanLiteral
put-it-up/scripts/network/network-firestore.js:4:19
 export class FirestoreStore {
   stickies = {};
   board = undefined;
-  connectCalled = false;
+  connectCalled = true;
   collectionName = "board-events";
   boardName = "my-board2";

[Survived] StringLiteral
put-it-up/scripts/network/network-firestore.js:5:20
   stickies = {};
   board = undefined;
   connectCalled = false;
-  collectionName = "board-events";
+  collectionName = "";
   boardName = "my-board2";
   observers = [];

[Survived] StringLiteral
put-it-up/scripts/network/network-firestore.js:6:15
   board = undefined;
   connectCalled = false;
   collectionName = "board-events";
-  boardName = "my-board2";
+  boardName = "";
   observers = [];
   readyForUse = false;

[Survived] ArrayDeclaration
put-it-up/scripts/network/network-firestore.js:7:15
   connectCalled = false;
   collectionName = "board-events";
   boardName = "my-board2";
-  observers = [];
+  observers = ["Stryker was here"];
   readyForUse = false;
 

[Survived] BooleanLiteral
put-it-up/scripts/network/network-firestore.js:8:17
   collectionName = "board-events";
   boardName = "my-board2";
   observers = [];
-  readyForUse = false;
+  readyForUse = true;
 
   connect() {

[Survived] BooleanLiteral
put-it-up/scripts/network/network-firestore.js:11:9
   readyForUse = false;
 
   connect() {
-    if (!this.connectCalled) {
+    if (this.connectCalled) {
       this.db = firebase.firestore();
       this.connectCalled = true;

[Survived] ConditionalExpression
put-it-up/scripts/network/network-firestore.js:11:9
   readyForUse = false;
 
   connect() {
-    if (!this.connectCalled) {
+    if (true) {
       this.db = firebase.firestore();
       this.connectCalled = true;

[Survived] BooleanLiteral
put-it-up/scripts/network/network-firestore.js:13:28
   connect() {
     if (!this.connectCalled) {
       this.db = firebase.firestore();
-      this.connectCalled = true;
+      this.connectCalled = false;
     }
     this.docRef = this.db.collection(this.collectionName).doc(this.boardName);

[Survived] BlockStatement
put-it-up/scripts/network/network-firestore.js:16:50
       this.connectCalled = true;
     }
     this.docRef = this.db.collection(this.collectionName).doc(this.boardName);
-    this.docRef.onSnapshot((documentSnapshot) => {
-      this.readyForUse = true;
-      const data = documentSnapshot.data();
-      if (data) {
-        this.board = data;
-      }
-      this.notifyBoardChange();
-    });
+    this.docRef.onSnapshot((documentSnapshot) => {});
 
     this.stickyRef = this.docRef.collection("stickies");

[Survived] BooleanLiteral
put-it-up/scripts/network/network-firestore.js:17:26
     }
     this.docRef = this.db.collection(this.collectionName).doc(this.boardName);
     this.docRef.onSnapshot((documentSnapshot) => {
-      this.readyForUse = true;
+      this.readyForUse = false;
       const data = documentSnapshot.data();
       if (data) {

[Survived] ConditionalExpression
put-it-up/scripts/network/network-firestore.js:19:11
     this.docRef.onSnapshot((documentSnapshot) => {
       this.readyForUse = true;
       const data = documentSnapshot.data();
-      if (data) {
+      if (true) {
         this.board = data;
       }

[Survived] BlockStatement
put-it-up/scripts/network/network-firestore.js:19:17
     this.docRef.onSnapshot((documentSnapshot) => {
       this.readyForUse = true;
       const data = documentSnapshot.data();
-      if (data) {
-        this.board = data;
-      }
+      if (data) {}
       this.notifyBoardChange();
     });

[Survived] BlockStatement
put-it-up/scripts/network/network-firestore.js:26:50
     });
 
     this.stickyRef = this.docRef.collection("stickies");
-    this.stickyRef.onSnapshot((querySnapshot) => {
-      doBatched(querySnapshot.docChanges(), (change) => {
-        if (change.type === "added" || change.type === "modified") {
-          this.stickies[change.doc.id] = change.doc.data();
-        } else if (change.type === "removed") {
-          delete this.stickies[change.doc.id];
-        }
-        this.notifyStickyChange(change.doc.id);
-      });
-    });
+    this.stickyRef.onSnapshot((querySnapshot) => {});
   }
 

[Survived] BlockStatement
put-it-up/scripts/network/network-firestore.js:27:57
 
     this.stickyRef = this.docRef.collection("stickies");
     this.stickyRef.onSnapshot((querySnapshot) => {
-      doBatched(querySnapshot.docChanges(), (change) => {
-        if (change.type === "added" || change.type === "modified") {
-          this.stickies[change.doc.id] = change.doc.data();
-        } else if (change.type === "removed") {
-          delete this.stickies[change.doc.id];
-        }
-        this.notifyStickyChange(change.doc.id);
-      });
+      doBatched(querySnapshot.docChanges(), (change) => {});
     });
   }

[Survived] ConditionalExpression
put-it-up/scripts/network/network-firestore.js:28:40
     this.stickyRef = this.docRef.collection("stickies");
     this.stickyRef.onSnapshot((querySnapshot) => {
       doBatched(querySnapshot.docChanges(), (change) => {
-        if (change.type === "added" || change.type === "modified") {
+        if (change.type === "added" || false) {
           this.stickies[change.doc.id] = change.doc.data();
         } else if (change.type === "removed") {

[Survived] ConditionalExpression
put-it-up/scripts/network/network-firestore.js:28:13
     this.stickyRef = this.docRef.collection("stickies");
     this.stickyRef.onSnapshot((querySnapshot) => {
       doBatched(querySnapshot.docChanges(), (change) => {
-        if (change.type === "added" || change.type === "modified") {
+        if (false) {
           this.stickies[change.doc.id] = change.doc.data();
         } else if (change.type === "removed") {

[Survived] EqualityOperator
put-it-up/scripts/network/network-firestore.js:30:20
       doBatched(querySnapshot.docChanges(), (change) => {
         if (change.type === "added" || change.type === "modified") {
           this.stickies[change.doc.id] = change.doc.data();
-        } else if (change.type === "removed") {
+        } else if (change.type !== "removed") {
           delete this.stickies[change.doc.id];
         }

[Survived] ConditionalExpression
put-it-up/scripts/network/network-firestore.js:30:20
       doBatched(querySnapshot.docChanges(), (change) => {
         if (change.type === "added" || change.type === "modified") {
           this.stickies[change.doc.id] = change.doc.data();
-        } else if (change.type === "removed") {
+        } else if (false) {
           delete this.stickies[change.doc.id];
         }

[Survived] BlockStatement
put-it-up/scripts/network/network-firestore.js:38:19
     });
   }
 
-  isReadyForUse() {
-    return this.readyForUse;
-  }
+  isReadyForUse() {}
 
   getBoard = (defaults) => {

[Survived] BlockStatement
put-it-up/scripts/network/network-firestore.js:42:28
     return this.readyForUse;
   }
 
-  getBoard = (defaults) => {
-    if (!this.board) {
-      this.board = defaults;
-      this.docRef.set(this.board);
-    }
-    return clone(this.board);
-  };
+  getBoard = (defaults) => {};
 
   getSticky = (id) => {

[Survived] ConditionalExpression
put-it-up/scripts/network/network-firestore.js:43:9
   }
 
   getBoard = (defaults) => {
-    if (!this.board) {
+    if (false) {
       this.board = defaults;
       this.docRef.set(this.board);

[Survived] ConditionalExpression
put-it-up/scripts/network/network-firestore.js:43:9
   }
 
   getBoard = (defaults) => {
-    if (!this.board) {
+    if (true) {
       this.board = defaults;
       this.docRef.set(this.board);

[Survived] BooleanLiteral
put-it-up/scripts/network/network-firestore.js:52:9
 
   getSticky = (id) => {
     const sticky = this.stickies[id];
-    if (!sticky) {
+    if (sticky) {
       throw new Error("No such sticky id=" + id);
     }

[Survived] StringLiteral
put-it-up/scripts/network/network-firestore.js:53:23
   getSticky = (id) => {
     const sticky = this.stickies[id];
     if (!sticky) {
-      throw new Error("No such sticky id=" + id);
+      throw new Error("" + id);
     }
     return sticky;

[Survived] BlockStatement
put-it-up/scripts/network/network-firestore.js:58:30
     return sticky;
   };
 
-  createSticky = (sticky) => {
-    const docRef = this.stickyRef.doc();
-    docRef.set(sticky, { merge: true });
-    this.stickies[docRef.id] = sticky;
-    return docRef.id;
-  };
+  createSticky = (sticky) => {};
 
   deleteSticky = (id) => {

[Survived] BooleanLiteral
put-it-up/scripts/network/network-firestore.js:60:33
 
   createSticky = (sticky) => {
     const docRef = this.stickyRef.doc();
-    docRef.set(sticky, { merge: true });
+    docRef.set(sticky, { merge: false });
     this.stickies[docRef.id] = sticky;
     return docRef.id;

[Survived] ObjectLiteral
put-it-up/scripts/network/network-firestore.js:60:24
 
   createSticky = (sticky) => {
     const docRef = this.stickyRef.doc();
-    docRef.set(sticky, { merge: true });
+    docRef.set(sticky, {});
     this.stickies[docRef.id] = sticky;
     return docRef.id;

[Survived] BlockStatement
put-it-up/scripts/network/network-firestore.js:65:26
     return docRef.id;
   };
 
-  deleteSticky = (id) => {
-    this.stickyRef.doc(id).delete();
-  };
+  deleteSticky = (id) => {};
 
   updateText = (id, text) => {

[Survived] BlockStatement
put-it-up/scripts/network/network-firestore.js:69:30
     this.stickyRef.doc(id).delete();
   };
 
-  updateText = (id, text) => {
-    this.stickyRef.doc(id).update({ text });
-  };
+  updateText = (id, text) => {};
 
   updateColor = (id, color) => {

[Survived] BlockStatement
put-it-up/scripts/network/network-firestore.js:73:32
     this.stickyRef.doc(id).update({ text });
   };
 
-  updateColor = (id, color) => {
-    this.stickyRef.doc(id).update({ color });
-  };
+  updateColor = (id, color) => {};
 
   setLocation = (id, location) => {

[Survived] BlockStatement
put-it-up/scripts/network/network-firestore.js:77:35
     this.stickyRef.doc(id).update({ color });
   };
 
-  setLocation = (id, location) => {
-    this.stickyRef.doc(id).update({ location });
-  };
+  setLocation = (id, location) => {};
 
   updateBoard = (board) => {

[Survived] ObjectLiteral
put-it-up/scripts/network/network-firestore.js:78:35
   };
 
   setLocation = (id, location) => {
-    this.stickyRef.doc(id).update({ location });
+    this.stickyRef.doc(id).update({});
   };
 

[Survived] BlockStatement
put-it-up/scripts/network/network-firestore.js:81:28
     this.stickyRef.doc(id).update({ location });
   };
 
-  updateBoard = (board) => {
-    this.docRef.update(board);
-  };
+  updateBoard = (board) => {};
   getState = () => clone({ stickies: this.stickies });
 

[Survived] ArrowFunction
put-it-up/scripts/network/network-firestore.js:84:14
   updateBoard = (board) => {
     this.docRef.update(board);
   };
-  getState = () => clone({ stickies: this.stickies });
+  getState = () => undefined;
 
   setState = (state) => {

[Survived] BlockStatement
put-it-up/scripts/network/network-firestore.js:107:33
   return JSON.parse(JSON.stringify(data));
 }
 
-function doBatched(array, task) {
-  function doRun() {
-    let timeElapsed = 0;
-    while (array.length && timeElapsed < 5) {
-      const item = array.shift();
-      const start = Date.now();
-      task(item);
-      timeElapsed += Date.now() - start;
-    }
-    if (array.length) {
-      requestAnimationFrame(doRun);
-    }
-  }
-  requestAnimationFrame(doRun);
-}
+function doBatched(array, task) {}
 

[Survived] BlockStatement
put-it-up/scripts/network/network-firestore.js:108:20
 }
 
 function doBatched(array, task) {
-  function doRun() {
-    let timeElapsed = 0;
-    while (array.length && timeElapsed < 5) {
-      const item = array.shift();
-      const start = Date.now();
-      task(item);
-      timeElapsed += Date.now() - start;
-    }
-    if (array.length) {
-      requestAnimationFrame(doRun);
-    }
-  }
+  function doRun() {}
   requestAnimationFrame(doRun);
 }

[Survived] ConditionalExpression
put-it-up/scripts/network/network-firestore.js:110:28
 function doBatched(array, task) {
   function doRun() {
     let timeElapsed = 0;
-    while (array.length && timeElapsed < 5) {
+    while (array.length && false) {
       const item = array.shift();
       const start = Date.now();

[Survived] ConditionalExpression
put-it-up/scripts/network/network-firestore.js:110:12
 function doBatched(array, task) {
   function doRun() {
     let timeElapsed = 0;
-    while (array.length && timeElapsed < 5) {
+    while (false) {
       const item = array.shift();
       const start = Date.now();

[Survived] ArithmeticOperator
put-it-up/scripts/network/network-firestore.js:114:22
       const item = array.shift();
       const start = Date.now();
       task(item);
-      timeElapsed += Date.now() - start;
+      timeElapsed += Date.now() + start;
     }
     if (array.length) {

[Survived] ConditionalExpression
put-it-up/scripts/network/network-firestore.js:116:9
       task(item);
       timeElapsed += Date.now() - start;
     }
-    if (array.length) {
+    if (true) {
       requestAnimationFrame(doRun);
     }

[Survived] ConditionalExpression
put-it-up/scripts/network/network-firestore.js:116:9
       task(item);
       timeElapsed += Date.now() - start;
     }
-    if (array.length) {
+    if (false) {
       requestAnimationFrame(doRun);
     }
