[Survived] BlockStatement
put-it-up/scripts/network/network-stubs.js:3:17
 export class PerfectNetwork {
   nodes = [];
-  connect(node) {
-    this.nodes.push(node);
-  }
+  connect(node) {}
   broadcast(sender, message) {
     this.nodes.forEach(node => {

[Survived] BlockStatement
put-it-up/scripts/network/network-stubs.js:6:30
   connect(node) {
     this.nodes.push(node);
   }
-  broadcast(sender, message) {
-    this.nodes.forEach(node => {
-      if (node !== sender) {
-        node.handleNetworkMessage(message);
-      }
-    });
-  }
+  broadcast(sender, message) {}
   wait() {
     return Promise.resolve(null);

[Survived] BlockStatement
put-it-up/scripts/network/network-stubs.js:7:32
     this.nodes.push(node);
   }
   broadcast(sender, message) {
-    this.nodes.forEach(node => {
-      if (node !== sender) {
-        node.handleNetworkMessage(message);
-      }
-    });
+    this.nodes.forEach(node => {});
   }
   wait() {

[Survived] EqualityOperator
put-it-up/scripts/network/network-stubs.js:8:11
   }
   broadcast(sender, message) {
     this.nodes.forEach(node => {
-      if (node !== sender) {
+      if (node === sender) {
         node.handleNetworkMessage(message);
       }

[Survived] BlockStatement
put-it-up/scripts/network/network-stubs.js:8:28
   }
   broadcast(sender, message) {
     this.nodes.forEach(node => {
-      if (node !== sender) {
-        node.handleNetworkMessage(message);
-      }
+      if (node !== sender) {}
     });
   }

[Survived] BlockStatement
put-it-up/scripts/network/network-stubs.js:13:10
       }
     });
   }
-  wait() {
-    return Promise.resolve(null);
-  }
+  wait() {}
 }
 

[Survived] ArrayDeclaration
put-it-up/scripts/network/network-stubs.js:20:14
 
 export class LossyNetwork {
   nodes = [];
-  promises = [];
+  promises = ["Stryker was here"];
   connect(node) {
     this.nodes.push(node);

[Survived] BlockStatement
put-it-up/scripts/network/network-stubs.js:21:17
 export class LossyNetwork {
   nodes = [];
   promises = [];
-  connect(node) {
-    this.nodes.push(node);
-  }
+  connect(node) {}
   broadcast(sender, message) {
     this.nodes.forEach(node => {

[Survived] BlockStatement
put-it-up/scripts/network/network-stubs.js:24:30
   connect(node) {
     this.nodes.push(node);
   }
-  broadcast(sender, message) {
-    this.nodes.forEach(node => {
-      if (node !== sender) {
-        this.promises.push(
-          sleep(randomInt(10)).then(() => node.handleNetworkMessage(message))
-        );
-      }
-    });
-  }
+  broadcast(sender, message) {}
   wait() {
     return Promise.all(this.promises);

[Survived] BlockStatement
put-it-up/scripts/network/network-stubs.js:25:32
     this.nodes.push(node);
   }
   broadcast(sender, message) {
-    this.nodes.forEach(node => {
-      if (node !== sender) {
-        this.promises.push(
-          sleep(randomInt(10)).then(() => node.handleNetworkMessage(message))
-        );
-      }
-    });
+    this.nodes.forEach(node => {});
   }
   wait() {

[Survived] BlockStatement
put-it-up/scripts/network/network-stubs.js:26:28
   }
   broadcast(sender, message) {
     this.nodes.forEach(node => {
-      if (node !== sender) {
-        this.promises.push(
-          sleep(randomInt(10)).then(() => node.handleNetworkMessage(message))
-        );
-      }
+      if (node !== sender) {}
     });
   }

[Survived] ConditionalExpression
put-it-up/scripts/network/network-stubs.js:26:11
   }
   broadcast(sender, message) {
     this.nodes.forEach(node => {
-      if (node !== sender) {
+      if (false) {
         this.promises.push(
           sleep(randomInt(10)).then(() => node.handleNetworkMessage(message))

[Survived] ArrowFunction
put-it-up/scripts/network/network-stubs.js:28:37
     this.nodes.forEach(node => {
       if (node !== sender) {
         this.promises.push(
-          sleep(randomInt(10)).then(() => node.handleNetworkMessage(message))
+          sleep(randomInt(10)).then(() => undefined)
         );
       }

[Survived] BlockStatement
put-it-up/scripts/network/network-stubs.js:33:10
       }
     });
   }
-  wait() {
-    return Promise.all(this.promises);
-  }
+  wait() {}
 }
 

[Survived] BlockStatement
put-it-up/scripts/network/network-stubs.js:38:20
   }
 }
 
-function sleep(ms) {
-  return new Promise((resolve) => {
-    setTimeout(resolve, ms);
-  });
-}
+function sleep(ms) {}
 
 function randomInt(maxExclusive) {

[Survived] BlockStatement
put-it-up/scripts/network/network-stubs.js:39:35
 }
 
 function sleep(ms) {
-  return new Promise((resolve) => {
-    setTimeout(resolve, ms);
-  });
+  return new Promise((resolve) => {});
 }
 

[Survived] BlockStatement
put-it-up/scripts/network/network-stubs.js:44:34
   });
 }
 
-function randomInt(maxExclusive) {
-  return Math.floor(Math.random() * maxExclusive);
-}
+function randomInt(maxExclusive) {}
 

[Survived] ArithmeticOperator
put-it-up/scripts/network/network-stubs.js:45:21
 }
 
 function randomInt(maxExclusive) {
-  return Math.floor(Math.random() * maxExclusive);
+  return Math.floor(Math.random() / maxExclusive);
 }
 
