[Survived] BooleanLiteral
put-it-up/scripts/ui/buffered-observer.js:2:24
 export function BufferedObserver(board, render, renderSticky) {
-  let isRunScheduled = false;
+  let isRunScheduled = true;
   const tasks = [];
   let tasksScheduledCount = 0;

[Survived] ArrayDeclaration
put-it-up/scripts/ui/buffered-observer.js:3:17
 export function BufferedObserver(board, render, renderSticky) {
   let isRunScheduled = false;
-  const tasks = [];
+  const tasks = ["Stryker was here"];
   let tasksScheduledCount = 0;
   function doRun() {

[Survived] BlockStatement
put-it-up/scripts/ui/buffered-observer.js:5:20
   let isRunScheduled = false;
   const tasks = [];
   let tasksScheduledCount = 0;
-  function doRun() {
-    let timeElapsed = 0;
-    while (tasks.length && timeElapsed < 14) {
-      const task = tasks.shift();
-      let start = Date.now();
-      task();
-      timeElapsed += Date.now() - start;
-    }
-    if (tasks.length) {
-      requestAnimationFrame(doRun);
-    } else {
-      isRunScheduled = false;
-    }
-  }
+  function doRun() {}
 
   function scheduleRenderTask(task) {

[Survived] ConditionalExpression
put-it-up/scripts/ui/buffered-observer.js:7:12
   let tasksScheduledCount = 0;
   function doRun() {
     let timeElapsed = 0;
-    while (tasks.length && timeElapsed < 14) {
+    while (false) {
       const task = tasks.shift();
       let start = Date.now();

[Survived] BlockStatement
put-it-up/scripts/ui/buffered-observer.js:7:46
   let tasksScheduledCount = 0;
   function doRun() {
     let timeElapsed = 0;
-    while (tasks.length && timeElapsed < 14) {
-      const task = tasks.shift();
-      let start = Date.now();
-      task();
-      timeElapsed += Date.now() - start;
-    }
+    while (tasks.length && timeElapsed < 14) {}
     if (tasks.length) {
       requestAnimationFrame(doRun);

[Survived] ArithmeticOperator
put-it-up/scripts/ui/buffered-observer.js:11:22
       const task = tasks.shift();
       let start = Date.now();
       task();
-      timeElapsed += Date.now() - start;
+      timeElapsed += Date.now() + start;
     }
     if (tasks.length) {

[Survived] ConditionalExpression
put-it-up/scripts/ui/buffered-observer.js:13:9
       task();
       timeElapsed += Date.now() - start;
     }
-    if (tasks.length) {
+    if (false) {
       requestAnimationFrame(doRun);
     } else {

[Survived] ConditionalExpression
put-it-up/scripts/ui/buffered-observer.js:13:9
       task();
       timeElapsed += Date.now() - start;
     }
-    if (tasks.length) {
+    if (true) {
       requestAnimationFrame(doRun);
     } else {

[Survived] BlockStatement
put-it-up/scripts/ui/buffered-observer.js:15:12
     }
     if (tasks.length) {
       requestAnimationFrame(doRun);
-    } else {
-      isRunScheduled = false;
-    }
+    } else {}
   }
 

[Survived] BooleanLiteral
put-it-up/scripts/ui/buffered-observer.js:16:24
     if (tasks.length) {
       requestAnimationFrame(doRun);
     } else {
-      isRunScheduled = false;
+      isRunScheduled = true;
     }
   }

[Survived] BlockStatement
put-it-up/scripts/ui/buffered-observer.js:20:37
     }
   }
 
-  function scheduleRenderTask(task) {
-    if (!isRunScheduled) {
-      requestAnimationFrame(doRun);
-      isRunScheduled = true;
-    }
-    tasks.push(task);
-    tasksScheduledCount++;
-  }
+  function scheduleRenderTask(task) {}
 
   this.numTasks = () => tasks.length;

[Survived] BlockStatement
put-it-up/scripts/ui/buffered-observer.js:21:26
   }
 
   function scheduleRenderTask(task) {
-    if (!isRunScheduled) {
-      requestAnimationFrame(doRun);
-      isRunScheduled = true;
-    }
+    if (!isRunScheduled) {}
     tasks.push(task);
     tasksScheduledCount++;

[Survived] ConditionalExpression
put-it-up/scripts/ui/buffered-observer.js:21:9
   }
 
   function scheduleRenderTask(task) {
-    if (!isRunScheduled) {
+    if (true) {
       requestAnimationFrame(doRun);
       isRunScheduled = true;

[Survived] BooleanLiteral
put-it-up/scripts/ui/buffered-observer.js:23:24
   function scheduleRenderTask(task) {
     if (!isRunScheduled) {
       requestAnimationFrame(doRun);
-      isRunScheduled = true;
+      isRunScheduled = false;
     }
     tasks.push(task);

[Survived] UpdateOperator
put-it-up/scripts/ui/buffered-observer.js:26:5
       isRunScheduled = true;
     }
     tasks.push(task);
-    tasksScheduledCount++;
+    tasksScheduledCount--;
   }
 

[Survived] ArrowFunction
put-it-up/scripts/ui/buffered-observer.js:29:19
     tasksScheduledCount++;
   }
 
-  this.numTasks = () => tasks.length;
+  this.numTasks = () => undefined;
 
   this.onStickyChange = (id) => {

[Survived] BlockStatement
put-it-up/scripts/ui/buffered-observer.js:31:33
 
   this.numTasks = () => tasks.length;
 
-  this.onStickyChange = (id) => {
-    scheduleRenderTask(() => renderSticky(id, board.getStickySafe(id)));
-  };
+  this.onStickyChange = (id) => {};
   this.onBoardChange = () => {
     scheduleRenderTask(() => render());

[Survived] ArrowFunction
put-it-up/scripts/ui/buffered-observer.js:32:24
   this.numTasks = () => tasks.length;
 
   this.onStickyChange = (id) => {
-    scheduleRenderTask(() => renderSticky(id, board.getStickySafe(id)));
+    scheduleRenderTask(() => undefined);
   };
   this.onBoardChange = () => {

[Survived] BlockStatement
put-it-up/scripts/ui/buffered-observer.js:34:30
   this.onStickyChange = (id) => {
     scheduleRenderTask(() => renderSticky(id, board.getStickySafe(id)));
   };
-  this.onBoardChange = () => {
-    scheduleRenderTask(() => render());
-  };
+  this.onBoardChange = () => {};
   this.tasksScheduledCount = () => tasksScheduledCount;
 }

[Survived] ArrowFunction
put-it-up/scripts/ui/buffered-observer.js:35:24
     scheduleRenderTask(() => renderSticky(id, board.getStickySafe(id)));
   };
   this.onBoardChange = () => {
-    scheduleRenderTask(() => render());
+    scheduleRenderTask(() => undefined);
   };
   this.tasksScheduledCount = () => tasksScheduledCount;

[Survived] ArrowFunction
put-it-up/scripts/ui/buffered-observer.js:37:30
   this.onBoardChange = () => {
     scheduleRenderTask(() => render());
   };
-  this.tasksScheduledCount = () => tasksScheduledCount;
+  this.tasksScheduledCount = () => undefined;
 }
 
