[Survived] StringLiteral
put-it-up/scripts/ui/render-to-dom.js:70:3
   "#AED6F1",
   "#82E0AA",
   "#F1948A",
-  "#C39BD3",
+  "",
 ];
 Object.freeze(colorPalette);

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:90:34
   const observer = new Observer(board, render, renderSticky);
   board.addObserver(observer);
   const selectedStickies = new Selection(observer);
-  function getSelectedStickies() {
-    return selectedStickies;
-  }
+  function getSelectedStickies() {}
   function renderBoard() {
     if (!board.isReadyForUse()) {

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:93:26
   function getSelectedStickies() {
     return selectedStickies;
   }
-  function renderBoard() {
-    if (!board.isReadyForUse()) {
-      return;
-    }
-    domElement.boardScale =
-      domElement.boardScale || zoomScale[zoomScale.length - 1];
-    const size = board.getBoardSize();
-    root.style.width = size.width * domElement.boardScale + "px";
-    root.style.height = size.height * domElement.boardScale + "px";
-    domElement.style.width = size.width + "px";
-    domElement.style.height = size.height + "px";
-    boardContainer.style.width = size.width * domElement.boardScale + "px";
-    boardContainer.style.height = size.height * domElement.boardScale + "px";
-    domElement.style.transform = `scale3d(${domElement.boardScale},${domElement.boardScale},1)`;
-    if (domElement.boardScale < 0.5) {
-      domElement.classList.add("sticky-text-hidden");
-    } else {
-      domElement.classList.remove("sticky-text-hidden");
-    }
-    if (nextClickCreatesNewSticky) {
-      domElement.classList.add("click-to-create");
-    } else {
-      domElement.classList.remove("click-to-create");
-    }
-  }
+  function renderBoard() {}
   let menuElement;
   const menuItems = [

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:94:33
     return selectedStickies;
   }
   function renderBoard() {
-    if (!board.isReadyForUse()) {
-      return;
-    }
+    if (!board.isReadyForUse()) {}
     domElement.boardScale =
       domElement.boardScale || zoomScale[zoomScale.length - 1];

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:94:9
     return selectedStickies;
   }
   function renderBoard() {
-    if (!board.isReadyForUse()) {
+    if (false) {
       return;
     }

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:98:7
       return;
     }
     domElement.boardScale =
-      domElement.boardScale || zoomScale[zoomScale.length - 1];
+      true;
     const size = board.getBoardSize();
     root.style.width = size.width * domElement.boardScale + "px";

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:98:7
       return;
     }
     domElement.boardScale =
-      domElement.boardScale || zoomScale[zoomScale.length - 1];
+      false;
     const size = board.getBoardSize();
     root.style.width = size.width * domElement.boardScale + "px";

[Survived] ArithmeticOperator
put-it-up/scripts/ui/render-to-dom.js:100:24
     domElement.boardScale =
       domElement.boardScale || zoomScale[zoomScale.length - 1];
     const size = board.getBoardSize();
-    root.style.width = size.width * domElement.boardScale + "px";
+    root.style.width = size.width / domElement.boardScale + "px";
     root.style.height = size.height * domElement.boardScale + "px";
     domElement.style.width = size.width + "px";

[Survived] ArithmeticOperator
put-it-up/scripts/ui/render-to-dom.js:101:25
       domElement.boardScale || zoomScale[zoomScale.length - 1];
     const size = board.getBoardSize();
     root.style.width = size.width * domElement.boardScale + "px";
-    root.style.height = size.height * domElement.boardScale + "px";
+    root.style.height = size.height / domElement.boardScale + "px";
     domElement.style.width = size.width + "px";
     domElement.style.height = size.height + "px";

[Survived] StringLiteral
put-it-up/scripts/ui/render-to-dom.js:102:43
     const size = board.getBoardSize();
     root.style.width = size.width * domElement.boardScale + "px";
     root.style.height = size.height * domElement.boardScale + "px";
-    domElement.style.width = size.width + "px";
+    domElement.style.width = size.width + "";
     domElement.style.height = size.height + "px";
     boardContainer.style.width = size.width * domElement.boardScale + "px";

[Survived] StringLiteral
put-it-up/scripts/ui/render-to-dom.js:103:45
     root.style.width = size.width * domElement.boardScale + "px";
     root.style.height = size.height * domElement.boardScale + "px";
     domElement.style.width = size.width + "px";
-    domElement.style.height = size.height + "px";
+    domElement.style.height = size.height + "";
     boardContainer.style.width = size.width * domElement.boardScale + "px";
     boardContainer.style.height = size.height * domElement.boardScale + "px";

[Survived] ArithmeticOperator
put-it-up/scripts/ui/render-to-dom.js:104:34
     root.style.height = size.height * domElement.boardScale + "px";
     domElement.style.width = size.width + "px";
     domElement.style.height = size.height + "px";
-    boardContainer.style.width = size.width * domElement.boardScale + "px";
+    boardContainer.style.width = size.width / domElement.boardScale + "px";
     boardContainer.style.height = size.height * domElement.boardScale + "px";
     domElement.style.transform = `scale3d(${domElement.boardScale},${domElement.boardScale},1)`;

[Survived] ArithmeticOperator
put-it-up/scripts/ui/render-to-dom.js:105:35
     domElement.style.width = size.width + "px";
     domElement.style.height = size.height + "px";
     boardContainer.style.width = size.width * domElement.boardScale + "px";
-    boardContainer.style.height = size.height * domElement.boardScale + "px";
+    boardContainer.style.height = size.height / domElement.boardScale + "px";
     domElement.style.transform = `scale3d(${domElement.boardScale},${domElement.boardScale},1)`;
     if (domElement.boardScale < 0.5) {

[Survived] StringLiteral
put-it-up/scripts/ui/render-to-dom.js:105:73
     domElement.style.width = size.width + "px";
     domElement.style.height = size.height + "px";
     boardContainer.style.width = size.width * domElement.boardScale + "px";
-    boardContainer.style.height = size.height * domElement.boardScale + "px";
+    boardContainer.style.height = size.height * domElement.boardScale + "";
     domElement.style.transform = `scale3d(${domElement.boardScale},${domElement.boardScale},1)`;
     if (domElement.boardScale < 0.5) {

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:107:38
     boardContainer.style.width = size.width * domElement.boardScale + "px";
     boardContainer.style.height = size.height * domElement.boardScale + "px";
     domElement.style.transform = `scale3d(${domElement.boardScale},${domElement.boardScale},1)`;
-    if (domElement.boardScale < 0.5) {
-      domElement.classList.add("sticky-text-hidden");
-    } else {
+    if (domElement.boardScale < 0.5) {} else {
       domElement.classList.remove("sticky-text-hidden");
     }

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:107:9
     boardContainer.style.width = size.width * domElement.boardScale + "px";
     boardContainer.style.height = size.height * domElement.boardScale + "px";
     domElement.style.transform = `scale3d(${domElement.boardScale},${domElement.boardScale},1)`;
-    if (domElement.boardScale < 0.5) {
+    if (false) {
       domElement.classList.add("sticky-text-hidden");
     } else {

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:109:12
     domElement.style.transform = `scale3d(${domElement.boardScale},${domElement.boardScale},1)`;
     if (domElement.boardScale < 0.5) {
       domElement.classList.add("sticky-text-hidden");
-    } else {
-      domElement.classList.remove("sticky-text-hidden");
-    }
+    } else {}
     if (nextClickCreatesNewSticky) {
       domElement.classList.add("click-to-create");

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:112:36
     } else {
       domElement.classList.remove("sticky-text-hidden");
     }
-    if (nextClickCreatesNewSticky) {
-      domElement.classList.add("click-to-create");
-    } else {
+    if (nextClickCreatesNewSticky) {} else {
       domElement.classList.remove("click-to-create");
     }

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:112:9
     } else {
       domElement.classList.remove("sticky-text-hidden");
     }
-    if (nextClickCreatesNewSticky) {
+    if (true) {
       domElement.classList.add("click-to-create");
     } else {

[Survived] StringLiteral
put-it-up/scripts/ui/render-to-dom.js:113:32
       domElement.classList.remove("sticky-text-hidden");
     }
     if (nextClickCreatesNewSticky) {
-      domElement.classList.add("click-to-create");
+      domElement.classList.add("");
     } else {
       domElement.classList.remove("click-to-create");

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:114:12
     }
     if (nextClickCreatesNewSticky) {
       domElement.classList.add("click-to-create");
-    } else {
-      domElement.classList.remove("click-to-create");
-    }
+    } else {}
   }
   let menuElement;

[Survived] StringLiteral
put-it-up/scripts/ui/render-to-dom.js:122:18
   const menuItems = [
     {
       itemLabel: "New sticky",
-      className: "new-sticky",
+      className: "",
       itemClickHandler: () => {
         nextClickCreatesNewSticky = true;

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:123:31
     {
       itemLabel: "New sticky",
       className: "new-sticky",
-      itemClickHandler: () => {
-        nextClickCreatesNewSticky = true;
-        renderBoard();
-      },
+      itemClickHandler: () => {},
     },
     {

[Survived] BooleanLiteral
put-it-up/scripts/ui/render-to-dom.js:124:37
       itemLabel: "New sticky",
       className: "new-sticky",
       itemClickHandler: () => {
-        nextClickCreatesNewSticky = true;
+        nextClickCreatesNewSticky = false;
         renderBoard();
       },

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:131:31
     {
       itemLabel: "Delete",
       className: "delete",
-      itemClickHandler: () => {
-        selectedStickies.forEach((id) => {
-          board.deleteSticky(id);
-        });
-      },
+      itemClickHandler: () => {},
     },
     {

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:132:42
       itemLabel: "Delete",
       className: "delete",
       itemClickHandler: () => {
-        selectedStickies.forEach((id) => {
-          board.deleteSticky(id);
-        });
+        selectedStickies.forEach((id) => {});
       },
     },

[Survived] ObjectLiteral
put-it-up/scripts/ui/render-to-dom.js:137:5
         });
       },
     },
-    {
-      itemLabel: "Color",
-      className: "change-color",
-      itemClickHandler: (event) => {
-        changeColor(event.shiftKey);
-      },
-      customLabel: (dom, label) => {
-        dom.innerHTML = 'text<div class="color-preview"></div>';
-        dom.firstChild.textContent = label;
-        dom.lastChild.style.backgroundColor = currentColor;
-      },
-    },
+    {},
     {
       itemLabel: "Zoom",

[Survived] StringLiteral
put-it-up/scripts/ui/render-to-dom.js:138:18
       },
     },
     {
-      itemLabel: "Color",
+      itemLabel: "",
       className: "change-color",
       itemClickHandler: (event) => {

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:140:36
     {
       itemLabel: "Color",
       className: "change-color",
-      itemClickHandler: (event) => {
-        changeColor(event.shiftKey);
-      },
+      itemClickHandler: (event) => {},
       customLabel: (dom, label) => {
         dom.innerHTML = 'text<div class="color-preview"></div>';

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:143:36
       itemClickHandler: (event) => {
         changeColor(event.shiftKey);
       },
-      customLabel: (dom, label) => {
-        dom.innerHTML = 'text<div class="color-preview"></div>';
-        dom.firstChild.textContent = label;
-        dom.lastChild.style.backgroundColor = currentColor;
-      },
+      customLabel: (dom, label) => {},
     },
     {

[Survived] StringLiteral
put-it-up/scripts/ui/render-to-dom.js:150:18
       },
     },
     {
-      itemLabel: "Zoom",
+      itemLabel: "",
       className: "change-zoom",
       itemClickHandler: (event) => {

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:152:36
     {
       itemLabel: "Zoom",
       className: "change-zoom",
-      itemClickHandler: (event) => {
-        changeZoomLevel(event.shiftKey);
-      },
+      itemClickHandler: (event) => {},
       customLabel: (dom, label) => {
         if (!domElement.boardScale) {

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:155:36
       itemClickHandler: (event) => {
         changeZoomLevel(event.shiftKey);
       },
-      customLabel: (dom, label) => {
-        if (!domElement.boardScale) {
-          dom.textContent = label;
-        } else {
-          dom.textContent = `${label} (${(domElement.boardScale * 100).toFixed(
-            0
-          )}%)`;
-        }
-      },
+      customLabel: (dom, label) => {},
     },
     {

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:156:13
         changeZoomLevel(event.shiftKey);
       },
       customLabel: (dom, label) => {
-        if (!domElement.boardScale) {
+        if (false) {
           dom.textContent = label;
         } else {

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:156:13
         changeZoomLevel(event.shiftKey);
       },
       customLabel: (dom, label) => {
-        if (!domElement.boardScale) {
+        if (true) {
           dom.textContent = label;
         } else {

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:158:16
       customLabel: (dom, label) => {
         if (!domElement.boardScale) {
           dom.textContent = label;
-        } else {
-          dom.textContent = `${label} (${(domElement.boardScale * 100).toFixed(
-            0
-          )}%)`;
-        }
+        } else {}
       },
     },

[Survived] ArithmeticOperator
put-it-up/scripts/ui/render-to-dom.js:159:43
         if (!domElement.boardScale) {
           dom.textContent = label;
         } else {
-          dom.textContent = `${label} (${(domElement.boardScale * 100).toFixed(
+          dom.textContent = `${label} (${(domElement.boardScale / 100).toFixed(
             0
           )}%)`;

[Survived] StringLiteral
put-it-up/scripts/ui/render-to-dom.js:159:29
         if (!domElement.boardScale) {
           dom.textContent = label;
         } else {
-          dom.textContent = `${label} (${(domElement.boardScale * 100).toFixed(
-            0
-          )}%)`;
+          dom.textContent = ``;
         }
       },

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:170:13
       className: "board-size",
       itemClickHandler: (activatingEvent) => {
         const container = document.createElement("div");
-        if (!document.querySelector(".sizing-controls")) {
+        if (true) {
           container.innerHTML = `<div class="sizing-controls">
             <label for="Grow">Grow</label>

[Survived] BooleanLiteral
put-it-up/scripts/ui/render-to-dom.js:170:13
       className: "board-size",
       itemClickHandler: (activatingEvent) => {
         const container = document.createElement("div");
-        if (!document.querySelector(".sizing-controls")) {
+        if (document.querySelector(".sizing-controls")) {
           container.innerHTML = `<div class="sizing-controls">
             <label for="Grow">Grow</label>

[Survived] StringLiteral
put-it-up/scripts/ui/render-to-dom.js:171:33
       itemClickHandler: (activatingEvent) => {
         const container = document.createElement("div");
         if (!document.querySelector(".sizing-controls")) {
-          container.innerHTML = `<div class="sizing-controls">
-            <label for="Grow">Grow</label>
-            <input type="radio" id="Grow" name="size-change-direction" value="Grow" checked="checked">
-            &nbsp;&nbsp;
-            <label for="Shrink">Shrink</label>
-            <input type="radio" id="Shrink" name="size-change-direction" value="Shrink">
-            <div class="grow-arrows">
-              <button class="top">${arrowHTML()}</button>
-              <button class="right">${arrowHTML()}</button>
-              <button class="bottom">${arrowHTML()}</button>
-              <button class="left">${arrowHTML()}</button>
-            </div>
-          </div>`;
+          container.innerHTML = ``;
           const sizingControls = container.firstElementChild;
           sizingControls.addEventListener("click", (event) => {

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:185:63
             </div>
           </div>`;
           const sizingControls = container.firstElementChild;
-          sizingControls.addEventListener("click", (event) => {
-            const isGrow = sizingControls.querySelector("#Grow").checked;
-            const side = ["top", "right", "bottom", "left"].find((side) =>
-              isChildOf(event.target, side)
-            );
-            board.changeSize(isGrow, side);
-          });
+          sizingControls.addEventListener("click", (event) => {});
           document.body.addEventListener("click", (event) => {
             if (

[Survived] StringLiteral
put-it-up/scripts/ui/render-to-dom.js:186:57
           </div>`;
           const sizingControls = container.firstElementChild;
           sizingControls.addEventListener("click", (event) => {
-            const isGrow = sizingControls.querySelector("#Grow").checked;
+            const isGrow = sizingControls.querySelector("").checked;
             const side = ["top", "right", "bottom", "left"].find((side) =>
               isChildOf(event.target, side)

[Survived] ArrowFunction
put-it-up/scripts/ui/render-to-dom.js:187:66
           const sizingControls = container.firstElementChild;
           sizingControls.addEventListener("click", (event) => {
             const isGrow = sizingControls.querySelector("#Grow").checked;
-            const side = ["top", "right", "bottom", "left"].find((side) =>
-              isChildOf(event.target, side)
+            const side = ["top", "right", "bottom", "left"].find(() => undefined
             );
             board.changeSize(isGrow, side);

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:192:62
             );
             board.changeSize(isGrow, side);
           });
-          document.body.addEventListener("click", (event) => {
-            if (
-              event !== activatingEvent &&
-              !isChildOf(event.target, "sizing-controls")
-            ) {
-              sizingControls.remove();
-            }
-          });
+          document.body.addEventListener("click", (event) => {});
           document.body.addEventListener("keydown", (event) => {
             if (event.key === "Escape") {

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:194:15
           });
           document.body.addEventListener("click", (event) => {
             if (
-              event !== activatingEvent &&
-              !isChildOf(event.target, "sizing-controls")
+              true
             ) {
               sizingControls.remove();

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:194:15
           });
           document.body.addEventListener("click", (event) => {
             if (
-              event !== activatingEvent &&
+              true &&
               !isChildOf(event.target, "sizing-controls")
             ) {

[Survived] BooleanLiteral
put-it-up/scripts/ui/render-to-dom.js:195:15
           document.body.addEventListener("click", (event) => {
             if (
               event !== activatingEvent &&
-              !isChildOf(event.target, "sizing-controls")
+              isChildOf(event.target, "sizing-controls")
             ) {
               sizingControls.remove();

[Survived] StringLiteral
put-it-up/scripts/ui/render-to-dom.js:195:40
           document.body.addEventListener("click", (event) => {
             if (
               event !== activatingEvent &&
-              !isChildOf(event.target, "sizing-controls")
+              !isChildOf(event.target, "")
             ) {
               sizingControls.remove();

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:196:15
             if (
               event !== activatingEvent &&
               !isChildOf(event.target, "sizing-controls")
-            ) {
-              sizingControls.remove();
-            }
+            ) {}
           });
           document.body.addEventListener("keydown", (event) => {

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:200:64
               sizingControls.remove();
             }
           });
-          document.body.addEventListener("keydown", (event) => {
-            if (event.key === "Escape") {
-              sizingControls.remove();
-            }
-          });
+          document.body.addEventListener("keydown", (event) => {});
           root.appendChild(sizingControls);
         }

[Survived] StringLiteral
put-it-up/scripts/ui/render-to-dom.js:200:42
               sizingControls.remove();
             }
           });
-          document.body.addEventListener("keydown", (event) => {
+          document.body.addEventListener("", (event) => {
             if (event.key === "Escape") {
               sizingControls.remove();

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:201:17
             }
           });
           document.body.addEventListener("keydown", (event) => {
-            if (event.key === "Escape") {
+            if (true) {
               sizingControls.remove();
             }

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:201:41
             }
           });
           document.body.addEventListener("keydown", (event) => {
-            if (event.key === "Escape") {
-              sizingControls.remove();
-            }
+            if (event.key === "Escape") {}
           });
           root.appendChild(sizingControls);

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:211:23
     },
   ];
   function renderMenu() {
-    if (!menuElement) {
-      menuElement = document.createElement("div");
-      menuElement.classList.add("board-action-menu");
-      menuItems.forEach((item) => {
-        menuElement.appendChild(renderMenuButton(item));
-      });
-      root.insertAdjacentElement("afterbegin", menuElement);
-      function renderMenuButton(item) {
-        const itemElement = document.createElement("button");
-        item.dom = itemElement;
-        itemElement.onclick = item.itemClickHandler;
-        itemElement.classList.add(item.className);
-        return itemElement;
-      }
-    }
+    if (!menuElement) {}
     menuItems.forEach(({ itemLabel, customLabel, dom }) => {
       if (itemLabel) {

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:211:9
     },
   ];
   function renderMenu() {
-    if (!menuElement) {
+    if (true) {
       menuElement = document.createElement("div");
       menuElement.classList.add("board-action-menu");

[Survived] StringLiteral
put-it-up/scripts/ui/render-to-dom.js:212:44
   ];
   function renderMenu() {
     if (!menuElement) {
-      menuElement = document.createElement("div");
+      menuElement = document.createElement("");
       menuElement.classList.add("board-action-menu");
       menuItems.forEach((item) => {

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:214:35
     if (!menuElement) {
       menuElement = document.createElement("div");
       menuElement.classList.add("board-action-menu");
-      menuItems.forEach((item) => {
-        menuElement.appendChild(renderMenuButton(item));
-      });
+      menuItems.forEach((item) => {});
       root.insertAdjacentElement("afterbegin", menuElement);
       function renderMenuButton(item) {

[Survived] StringLiteral
put-it-up/scripts/ui/render-to-dom.js:217:34
       menuItems.forEach((item) => {
         menuElement.appendChild(renderMenuButton(item));
       });
-      root.insertAdjacentElement("afterbegin", menuElement);
+      root.insertAdjacentElement("", menuElement);
       function renderMenuButton(item) {
         const itemElement = document.createElement("button");

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:218:39
         menuElement.appendChild(renderMenuButton(item));
       });
       root.insertAdjacentElement("afterbegin", menuElement);
-      function renderMenuButton(item) {
-        const itemElement = document.createElement("button");
-        item.dom = itemElement;
-        itemElement.onclick = item.itemClickHandler;
-        itemElement.classList.add(item.className);
-        return itemElement;
-      }
+      function renderMenuButton(item) {}
     }
     menuItems.forEach(({ itemLabel, customLabel, dom }) => {

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:226:60
         return itemElement;
       }
     }
-    menuItems.forEach(({ itemLabel, customLabel, dom }) => {
-      if (itemLabel) {
-        if (customLabel) {
-          customLabel(dom, itemLabel);
-        } else {
-          dom.textContent = itemLabel;
-        }
-      }
-    });
+    menuItems.forEach(({ itemLabel, customLabel, dom }) => {});
   }
   function render() {

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:227:11
       }
     }
     menuItems.forEach(({ itemLabel, customLabel, dom }) => {
-      if (itemLabel) {
+      if (false) {
         if (customLabel) {
           customLabel(dom, itemLabel);

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:227:22
       }
     }
     menuItems.forEach(({ itemLabel, customLabel, dom }) => {
-      if (itemLabel) {
-        if (customLabel) {
-          customLabel(dom, itemLabel);
-        } else {
-          dom.textContent = itemLabel;
-        }
-      }
+      if (itemLabel) {}
     });
   }

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:228:13
     }
     menuItems.forEach(({ itemLabel, customLabel, dom }) => {
       if (itemLabel) {
-        if (customLabel) {
+        if (true) {
           customLabel(dom, itemLabel);
         } else {

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:228:26
     }
     menuItems.forEach(({ itemLabel, customLabel, dom }) => {
       if (itemLabel) {
-        if (customLabel) {
-          customLabel(dom, itemLabel);
-        } else {
+        if (customLabel) {} else {
           dom.textContent = itemLabel;
         }

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:230:16
       if (itemLabel) {
         if (customLabel) {
           customLabel(dom, itemLabel);
-        } else {
-          dom.textContent = itemLabel;
-        }
+        } else {}
       }
     });

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:236:21
       }
     });
   }
-  function render() {
-    renderBoard();
-    renderMenu();
-    Object.entries(board.getState().stickies).forEach(([stickyId, sticky]) =>
-      renderSticky(stickyId, sticky)
-    );
-  }
+  function render() {}
 
   domElement.ondragover = (event) => {

[Survived] ArrowFunction
put-it-up/scripts/ui/render-to-dom.js:239:55
   function render() {
     renderBoard();
     renderMenu();
-    Object.entries(board.getState().stickies).forEach(([stickyId, sticky]) =>
-      renderSticky(stickyId, sticky)
+    Object.entries(board.getState().stickies).forEach(() => undefined
     );
   }

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:244:38
     );
   }
 
-  domElement.ondragover = (event) => {
-    event.preventDefault();
-  };
+  domElement.ondragover = (event) => {};
 
   domElement.ondrop = (event) => {

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:248:34
     event.preventDefault();
   };
 
-  domElement.ondrop = (event) => {
-    const { pageX: x, pageY: y } = event;
-    const { originalLocations, dragStart } = JSON.parse(
-      event.dataTransfer.getData(STICKY_TYPE)
-    );
-    const offset = {
-      x: (x - dragStart.x) / domElement.boardScale,
-      y: (y - dragStart.y) / domElement.boardScale,
-    };
-    Object.keys(originalLocations).forEach((id) => {
-      const originalLocation = originalLocations[id];
-      const newLocation = {
-        x: originalLocation.x + offset.x,
-        y: originalLocation.y + offset.y,
-      };
-      stickiesMovedByDragging.push(id);
-      board.moveSticky(id, newLocation);
-    });
-  };
+  domElement.ondrop = (event) => {};
   function moveSelection(dx, dy) {
     selectedStickies.forEach((sid) => {

[Survived] ObjectLiteral
put-it-up/scripts/ui/render-to-dom.js:253:20
     const { originalLocations, dragStart } = JSON.parse(
       event.dataTransfer.getData(STICKY_TYPE)
     );
-    const offset = {
-      x: (x - dragStart.x) / domElement.boardScale,
-      y: (y - dragStart.y) / domElement.boardScale,
-    };
+    const offset = {};
     Object.keys(originalLocations).forEach((id) => {
       const originalLocation = originalLocations[id];

[Survived] ArithmeticOperator
put-it-up/scripts/ui/render-to-dom.js:254:11
       event.dataTransfer.getData(STICKY_TYPE)
     );
     const offset = {
-      x: (x - dragStart.x) / domElement.boardScale,
+      x: (x + dragStart.x) / domElement.boardScale,
       y: (y - dragStart.y) / domElement.boardScale,
     };
