[Survived] ArithmeticOperator
put-it-up/scripts/ui/render-to-dom.js:254:10
       event.dataTransfer.getData(STICKY_TYPE)
     );
     const offset = {
-      x: (x - dragStart.x) / domElement.boardScale,
+      x: (x - dragStart.x) * domElement.boardScale,
       y: (y - dragStart.y) / domElement.boardScale,
     };

[Survived] ArithmeticOperator
put-it-up/scripts/ui/render-to-dom.js:255:10
     );
     const offset = {
       x: (x - dragStart.x) / domElement.boardScale,
-      y: (y - dragStart.y) / domElement.boardScale,
+      y: (y - dragStart.y) * domElement.boardScale,
     };
     Object.keys(originalLocations).forEach((id) => {

[Survived] ArithmeticOperator
put-it-up/scripts/ui/render-to-dom.js:255:11
     );
     const offset = {
       x: (x - dragStart.x) / domElement.boardScale,
-      y: (y - dragStart.y) / domElement.boardScale,
+      y: (y + dragStart.y) / domElement.boardScale,
     };
     Object.keys(originalLocations).forEach((id) => {

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:257:52
       x: (x - dragStart.x) / domElement.boardScale,
       y: (y - dragStart.y) / domElement.boardScale,
     };
-    Object.keys(originalLocations).forEach((id) => {
-      const originalLocation = originalLocations[id];
-      const newLocation = {
-        x: originalLocation.x + offset.x,
-        y: originalLocation.y + offset.y,
-      };
-      stickiesMovedByDragging.push(id);
-      board.moveSticky(id, newLocation);
-    });
+    Object.keys(originalLocations).forEach((id) => {});
   };
   function moveSelection(dx, dy) {

[Survived] ArithmeticOperator
put-it-up/scripts/ui/render-to-dom.js:260:12
     Object.keys(originalLocations).forEach((id) => {
       const originalLocation = originalLocations[id];
       const newLocation = {
-        x: originalLocation.x + offset.x,
+        x: originalLocation.x - offset.x,
         y: originalLocation.y + offset.y,
       };

[Survived] ArithmeticOperator
put-it-up/scripts/ui/render-to-dom.js:261:12
       const originalLocation = originalLocations[id];
       const newLocation = {
         x: originalLocation.x + offset.x,
-        y: originalLocation.y + offset.y,
+        y: originalLocation.y - offset.y,
       };
       stickiesMovedByDragging.push(id);

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:267:34
       board.moveSticky(id, newLocation);
     });
   };
-  function moveSelection(dx, dy) {
-    selectedStickies.forEach((sid) => {
-      const originalLocation = board.getStickyLocation(sid);
-      const newLocation = {
-        x: originalLocation.x + dx,
-        y: originalLocation.y + dy,
-      };
-      board.moveSticky(sid, newLocation);
-    });
-  }
+  function moveSelection(dx, dy) {}
   function changeZoomLevel(reverse) {
     let index =

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:268:39
     });
   };
   function moveSelection(dx, dy) {
-    selectedStickies.forEach((sid) => {
-      const originalLocation = board.getStickyLocation(sid);
-      const newLocation = {
-        x: originalLocation.x + dx,
-        y: originalLocation.y + dy,
-      };
-      board.moveSticky(sid, newLocation);
-    });
+    selectedStickies.forEach((sid) => {});
   }
   function changeZoomLevel(reverse) {

[Survived] ObjectLiteral
put-it-up/scripts/ui/render-to-dom.js:270:27
   function moveSelection(dx, dy) {
     selectedStickies.forEach((sid) => {
       const originalLocation = board.getStickyLocation(sid);
-      const newLocation = {
-        x: originalLocation.x + dx,
-        y: originalLocation.y + dy,
-      };
+      const newLocation = {};
       board.moveSticky(sid, newLocation);
     });

[Survived] ArithmeticOperator
put-it-up/scripts/ui/render-to-dom.js:271:12
     selectedStickies.forEach((sid) => {
       const originalLocation = board.getStickyLocation(sid);
       const newLocation = {
-        x: originalLocation.x + dx,
+        x: originalLocation.x - dx,
         y: originalLocation.y + dy,
       };

[Survived] ArithmeticOperator
put-it-up/scripts/ui/render-to-dom.js:272:12
       const originalLocation = board.getStickyLocation(sid);
       const newLocation = {
         x: originalLocation.x + dx,
-        y: originalLocation.y + dy,
+        y: originalLocation.y - dy,
       };
       board.moveSticky(sid, newLocation);

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:277:37
       board.moveSticky(sid, newLocation);
     });
   }
-  function changeZoomLevel(reverse) {
-    let index =
-      zoomScale.findIndex((v) => v === domElement.boardScale) +
-      (reverse ? -1 : 1);
-    domElement.boardScale = zoomScale[index % zoomScale.length];
-    render(board, domElement);
-  }
+  function changeZoomLevel(reverse) {}
   function changeColor(reverse) {
     if (selectedStickies.hasItems()) {

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:279:34
   }
   function changeZoomLevel(reverse) {
     let index =
-      zoomScale.findIndex((v) => v === domElement.boardScale) +
+      zoomScale.findIndex((v) => false) +
       (reverse ? -1 : 1);
     domElement.boardScale = zoomScale[index % zoomScale.length];

[Survived] ArithmeticOperator
put-it-up/scripts/ui/render-to-dom.js:279:7
   }
   function changeZoomLevel(reverse) {
     let index =
-      zoomScale.findIndex((v) => v === domElement.boardScale) +
-      (reverse ? -1 : 1);
+      zoomScale.findIndex(v => v === domElement.boardScale) - (reverse ? -1 : 1);
     domElement.boardScale = zoomScale[index % zoomScale.length];
     render(board, domElement);

[Survived] UnaryOperator
put-it-up/scripts/ui/render-to-dom.js:280:18
   function changeZoomLevel(reverse) {
     let index =
       zoomScale.findIndex((v) => v === domElement.boardScale) +
-      (reverse ? -1 : 1);
+      (reverse ? +1 : 1);
     domElement.boardScale = zoomScale[index % zoomScale.length];
     render(board, domElement);

[Survived] ArithmeticOperator
put-it-up/scripts/ui/render-to-dom.js:281:39
     let index =
       zoomScale.findIndex((v) => v === domElement.boardScale) +
       (reverse ? -1 : 1);
-    domElement.boardScale = zoomScale[index % zoomScale.length];
+    domElement.boardScale = zoomScale[index * zoomScale.length];
     render(board, domElement);
   }

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:285:38
     render(board, domElement);
   }
   function changeColor(reverse) {
-    if (selectedStickies.hasItems()) {
-      if (multipleSelectedHaveSameColor() || singleSelectedHasCurrentColor()) {
-        nextColor();
-      }
-      selectedStickies.forEach((id) => {
-        board.updateColor(id, currentColor);
-      });
-    } else {
+    if (selectedStickies.hasItems()) {} else {
       nextColor();
     }

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:285:9
     render(board, domElement);
   }
   function changeColor(reverse) {
-    if (selectedStickies.hasItems()) {
+    if (false) {
       if (multipleSelectedHaveSameColor() || singleSelectedHasCurrentColor()) {
         nextColor();

[Survived] LogicalOperator
put-it-up/scripts/ui/render-to-dom.js:286:11
   }
   function changeColor(reverse) {
     if (selectedStickies.hasItems()) {
-      if (multipleSelectedHaveSameColor() || singleSelectedHasCurrentColor()) {
+      if (multipleSelectedHaveSameColor() && singleSelectedHasCurrentColor()) {
         nextColor();
       }

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:286:79
   }
   function changeColor(reverse) {
     if (selectedStickies.hasItems()) {
-      if (multipleSelectedHaveSameColor() || singleSelectedHasCurrentColor()) {
-        nextColor();
-      }
+      if (multipleSelectedHaveSameColor() || singleSelectedHasCurrentColor()) {}
       selectedStickies.forEach((id) => {
         board.updateColor(id, currentColor);

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:289:40
       if (multipleSelectedHaveSameColor() || singleSelectedHasCurrentColor()) {
         nextColor();
       }
-      selectedStickies.forEach((id) => {
-        board.updateColor(id, currentColor);
-      });
+      selectedStickies.forEach((id) => {});
     } else {
       nextColor();

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:292:12
       selectedStickies.forEach((id) => {
         board.updateColor(id, currentColor);
       });
-    } else {
-      nextColor();
-    }
+    } else {}
     function nextColor() {
       const delta = reverse ? -1 : 1;

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:295:26
     } else {
       nextColor();
     }
-    function nextColor() {
-      const delta = reverse ? -1 : 1;
-      let index =
-        (colorPalette.findIndex((c) => c === currentColor) + delta) %
-        colorPalette.length;
-      if (index < 0) {
-        index += colorPalette.length;
-      }
-      currentColor = colorPalette[index];
-      renderMenu();
-    }
+    function nextColor() {}
     function multipleSelectedHaveSameColor() {
       const colors = selectedColors();

[Survived] UnaryOperator
put-it-up/scripts/ui/render-to-dom.js:296:31
       nextColor();
     }
     function nextColor() {
-      const delta = reverse ? -1 : 1;
+      const delta = reverse ? +1 : 1;
       let index =
         (colorPalette.findIndex((c) => c === currentColor) + delta) %

[Survived] EqualityOperator
put-it-up/scripts/ui/render-to-dom.js:298:40
     function nextColor() {
       const delta = reverse ? -1 : 1;
       let index =
-        (colorPalette.findIndex((c) => c === currentColor) + delta) %
+        (colorPalette.findIndex((c) => c !== currentColor) + delta) %
         colorPalette.length;
       if (index < 0) {

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:298:40
     function nextColor() {
       const delta = reverse ? -1 : 1;
       let index =
-        (colorPalette.findIndex((c) => c === currentColor) + delta) %
+        (colorPalette.findIndex((c) => true) + delta) %
         colorPalette.length;
       if (index < 0) {

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:300:11
       let index =
         (colorPalette.findIndex((c) => c === currentColor) + delta) %
         colorPalette.length;
-      if (index < 0) {
+      if (true) {
         index += colorPalette.length;
       }

[Survived] EqualityOperator
put-it-up/scripts/ui/render-to-dom.js:300:11
       let index =
         (colorPalette.findIndex((c) => c === currentColor) + delta) %
         colorPalette.length;
-      if (index < 0) {
+      if (index <= 0) {
         index += colorPalette.length;
       }

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:306:46
       currentColor = colorPalette[index];
       renderMenu();
     }
-    function multipleSelectedHaveSameColor() {
-      const colors = selectedColors();
-      return colors.length > 1 && colors.every((color) => color === colors[0]);
-    }
+    function multipleSelectedHaveSameColor() {}
     function singleSelectedHasCurrentColor() {
       const colors = selectedColors();

[Survived] EqualityOperator
put-it-up/scripts/ui/render-to-dom.js:308:14
     }
     function multipleSelectedHaveSameColor() {
       const colors = selectedColors();
-      return colors.length > 1 && colors.every((color) => color === colors[0]);
+      return colors.length >= 1 && colors.every((color) => color === colors[0]);
     }
     function singleSelectedHasCurrentColor() {

[Survived] EqualityOperator
put-it-up/scripts/ui/render-to-dom.js:308:59
     }
     function multipleSelectedHaveSameColor() {
       const colors = selectedColors();
-      return colors.length > 1 && colors.every((color) => color === colors[0]);
+      return colors.length > 1 && colors.every((color) => color !== colors[0]);
     }
     function singleSelectedHasCurrentColor() {

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:310:46
       const colors = selectedColors();
       return colors.length > 1 && colors.every((color) => color === colors[0]);
     }
-    function singleSelectedHasCurrentColor() {
-      const colors = selectedColors();
-      return colors.length === 1 && colors[0] === currentColor;
-    }
+    function singleSelectedHasCurrentColor() {}
     function selectedColors() {
       const colors = [];

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:312:14
     }
     function singleSelectedHasCurrentColor() {
       const colors = selectedColors();
-      return colors.length === 1 && colors[0] === currentColor;
+      return true;
     }
     function selectedColors() {

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:312:14
     }
     function singleSelectedHasCurrentColor() {
       const colors = selectedColors();
-      return colors.length === 1 && colors[0] === currentColor;
+      return true && colors[0] === currentColor;
     }
     function selectedColors() {

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:314:31
       const colors = selectedColors();
       return colors.length === 1 && colors[0] === currentColor;
     }
-    function selectedColors() {
-      const colors = [];
-      selectedStickies.forEach((id) => colors.push(board.getSticky(id).color));
-      return colors;
-    }
+    function selectedColors() {}
   }
   let nextClickCreatesNewSticky = false;

[Survived] ArrayDeclaration
put-it-up/scripts/ui/render-to-dom.js:315:22
       return colors.length === 1 && colors[0] === currentColor;
     }
     function selectedColors() {
-      const colors = [];
+      const colors = ["Stryker was here"];
       selectedStickies.forEach((id) => colors.push(board.getSticky(id).color));
       return colors;

[Survived] ArrowFunction
put-it-up/scripts/ui/render-to-dom.js:316:32
     }
     function selectedColors() {
       const colors = [];
-      selectedStickies.forEach((id) => colors.push(board.getSticky(id).color));
+      selectedStickies.forEach(() => undefined);
       return colors;
     }

[Survived] BooleanLiteral
put-it-up/scripts/ui/render-to-dom.js:320:35
       return colors;
     }
   }
-  let nextClickCreatesNewSticky = false;
+  let nextClickCreatesNewSticky = true;
   document.body.onkeydown = (event) => {
     if (event.key === "o" || event.key === "O") {

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:322:30
   }
   let nextClickCreatesNewSticky = false;
   document.body.onkeydown = (event) => {
-    if (event.key === "o" || event.key === "O") {
+    if (event.key === "o" || false) {
       changeZoomLevel(event.shiftKey);
     } else if (event.key === "n") {

[Survived] LogicalOperator
put-it-up/scripts/ui/render-to-dom.js:322:9
   }
   let nextClickCreatesNewSticky = false;
   document.body.onkeydown = (event) => {
-    if (event.key === "o" || event.key === "O") {
+    if (event.key === "o" && event.key === "O") {
       changeZoomLevel(event.shiftKey);
     } else if (event.key === "n") {

[Survived] EqualityOperator
put-it-up/scripts/ui/render-to-dom.js:324:16
   document.body.onkeydown = (event) => {
     if (event.key === "o" || event.key === "O") {
       changeZoomLevel(event.shiftKey);
-    } else if (event.key === "n") {
+    } else if (event.key !== "n") {
       nextClickCreatesNewSticky = true;
       renderBoard();

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:324:16
   document.body.onkeydown = (event) => {
     if (event.key === "o" || event.key === "O") {
       changeZoomLevel(event.shiftKey);
-    } else if (event.key === "n") {
+    } else if (false) {
       nextClickCreatesNewSticky = true;
       renderBoard();

[Survived] BooleanLiteral
put-it-up/scripts/ui/render-to-dom.js:325:35
     if (event.key === "o" || event.key === "O") {
       changeZoomLevel(event.shiftKey);
     } else if (event.key === "n") {
-      nextClickCreatesNewSticky = true;
+      nextClickCreatesNewSticky = false;
       renderBoard();
     } else if (event.key === "Escape") {

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:327:16
     } else if (event.key === "n") {
       nextClickCreatesNewSticky = true;
       renderBoard();
-    } else if (event.key === "Escape") {
+    } else if (false) {
       if (nextClickCreatesNewSticky) {
         nextClickCreatesNewSticky = false;

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:327:40
     } else if (event.key === "n") {
       nextClickCreatesNewSticky = true;
       renderBoard();
-    } else if (event.key === "Escape") {
-      if (nextClickCreatesNewSticky) {
-        nextClickCreatesNewSticky = false;
-        renderBoard();
-      }
-    } else if (event.key === "c" || event.key === "C") {
+    } else if (event.key === "Escape") {} else if (event.key === "c" || event.key === "C") {
       changeColor(event.shiftKey);
     } else if (event.key === "Delete") {

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:328:11
       nextClickCreatesNewSticky = true;
       renderBoard();
     } else if (event.key === "Escape") {
-      if (nextClickCreatesNewSticky) {
+      if (true) {
         nextClickCreatesNewSticky = false;
         renderBoard();

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:328:38
       nextClickCreatesNewSticky = true;
       renderBoard();
     } else if (event.key === "Escape") {
-      if (nextClickCreatesNewSticky) {
-        nextClickCreatesNewSticky = false;
-        renderBoard();
-      }
+      if (nextClickCreatesNewSticky) {}
     } else if (event.key === "c" || event.key === "C") {
       changeColor(event.shiftKey);

[Survived] BooleanLiteral
put-it-up/scripts/ui/render-to-dom.js:329:37
       renderBoard();
     } else if (event.key === "Escape") {
       if (nextClickCreatesNewSticky) {
-        nextClickCreatesNewSticky = false;
+        nextClickCreatesNewSticky = true;
         renderBoard();
       }

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:332:56
         nextClickCreatesNewSticky = false;
         renderBoard();
       }
-    } else if (event.key === "c" || event.key === "C") {
-      changeColor(event.shiftKey);
-    } else if (event.key === "Delete") {
+    } else if (event.key === "c" || event.key === "C") {} else if (event.key === "Delete") {
       selectedStickies.forEach((id) => {
         board.deleteSticky(id);

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:332:37
         nextClickCreatesNewSticky = false;
         renderBoard();
       }
-    } else if (event.key === "c" || event.key === "C") {
+    } else if (event.key === "c" || false) {
       changeColor(event.shiftKey);
     } else if (event.key === "Delete") {

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:334:40
       }
     } else if (event.key === "c" || event.key === "C") {
       changeColor(event.shiftKey);
-    } else if (event.key === "Delete") {
-      selectedStickies.forEach((id) => {
-        board.deleteSticky(id);
-      });
-    } else if (event.key.startsWith("Arrow") && selectedStickies.hasItems()) {
+    } else if (event.key === "Delete") {} else if (event.key.startsWith("Arrow") && selectedStickies.hasItems()) {
       event.preventDefault();
       const gridUnit = board.getGridUnit();

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:334:16
       }
     } else if (event.key === "c" || event.key === "C") {
       changeColor(event.shiftKey);
-    } else if (event.key === "Delete") {
+    } else if (true) {
       selectedStickies.forEach((id) => {
         board.deleteSticky(id);

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:335:40
     } else if (event.key === "c" || event.key === "C") {
       changeColor(event.shiftKey);
     } else if (event.key === "Delete") {
-      selectedStickies.forEach((id) => {
-        board.deleteSticky(id);
-      });
+      selectedStickies.forEach((id) => {});
     } else if (event.key.startsWith("Arrow") && selectedStickies.hasItems()) {
       event.preventDefault();

[Survived] LogicalOperator
put-it-up/scripts/ui/render-to-dom.js:338:16
       selectedStickies.forEach((id) => {
         board.deleteSticky(id);
       });
-    } else if (event.key.startsWith("Arrow") && selectedStickies.hasItems()) {
+    } else if (event.key.startsWith("Arrow") || selectedStickies.hasItems()) {
       event.preventDefault();
       const gridUnit = board.getGridUnit();

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:338:16
       selectedStickies.forEach((id) => {
         board.deleteSticky(id);
       });
-    } else if (event.key.startsWith("Arrow") && selectedStickies.hasItems()) {
+    } else if (true) {
       event.preventDefault();
       const gridUnit = board.getGridUnit();

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:342:9
       event.preventDefault();
       const gridUnit = board.getGridUnit();
       switch (event.key) {
-        case "ArrowUp":
-          moveSelection(0, -gridUnit);
-          break;
+        case "ArrowUp":
         case "ArrowDown":
           moveSelection(0, gridUnit);

[Survived] StringLiteral
put-it-up/scripts/ui/render-to-dom.js:342:14
       event.preventDefault();
       const gridUnit = board.getGridUnit();
       switch (event.key) {
-        case "ArrowUp":
+        case "":
           moveSelection(0, -gridUnit);
           break;

[Survived] UnaryOperator
put-it-up/scripts/ui/render-to-dom.js:343:28
       const gridUnit = board.getGridUnit();
       switch (event.key) {
         case "ArrowUp":
-          moveSelection(0, -gridUnit);
+          moveSelection(0, +gridUnit);
           break;
         case "ArrowDown":

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:345:9
         case "ArrowUp":
           moveSelection(0, -gridUnit);
           break;
-        case "ArrowDown":
-          moveSelection(0, gridUnit);
-          break;
+        case "ArrowDown":
         case "ArrowLeft":
           moveSelection(-gridUnit, 0);

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:348:9
         case "ArrowDown":
           moveSelection(0, gridUnit);
           break;
-        case "ArrowLeft":
-          moveSelection(-gridUnit, 0);
-          break;
+        case "ArrowLeft":
         case "ArrowRight":
           moveSelection(gridUnit, 0);

[Survived] StringLiteral
put-it-up/scripts/ui/render-to-dom.js:348:14
         case "ArrowDown":
           moveSelection(0, gridUnit);
           break;
-        case "ArrowLeft":
+        case "":
           moveSelection(-gridUnit, 0);
           break;

[Survived] UnaryOperator
put-it-up/scripts/ui/render-to-dom.js:349:25
           moveSelection(0, gridUnit);
           break;
         case "ArrowLeft":
-          moveSelection(-gridUnit, 0);
+          moveSelection(+gridUnit, 0);
           break;
         case "ArrowRight":

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:351:9
         case "ArrowLeft":
           moveSelection(-gridUnit, 0);
           break;
-        case "ArrowRight":
-          moveSelection(gridUnit, 0);
-          break;
+        case "ArrowRight":
         default:
           break;

[Survived] StringLiteral
put-it-up/scripts/ui/render-to-dom.js:351:14
         case "ArrowLeft":
           moveSelection(-gridUnit, 0);
           break;
-        case "ArrowRight":
+        case "":
           moveSelection(gridUnit, 0);
           break;

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:359:35
       }
     }
   };
-  domElement.onclick = (event) => {
-    if (nextClickCreatesNewSticky) {
-      nextClickCreatesNewSticky = false;
-      const rect = domElement.getBoundingClientRect();
-      const origin = board.getOrigin();
-      const location = {
-        x:
-          (event.clientX - rect.left - 50 * domElement.boardScale) /
-            domElement.boardScale +
-          origin.x,
-        y:
-          (event.clientY - rect.top - 50 * domElement.boardScale) /
-            domElement.boardScale +
-          origin.y,
-      };
-      const id = board.putSticky({ color: currentColor, location });
-      selectedStickies.replaceSelection(id);
-      renderBoard();
-    } else if (event.target === domElement && !event.shiftKey) {
-      selectedStickies.clearSelection();
-    }
-  };
+  domElement.onclick = (event) => {};
   render();
   return {

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:360:36
     }
   };
   domElement.onclick = (event) => {
-    if (nextClickCreatesNewSticky) {
-      nextClickCreatesNewSticky = false;
-      const rect = domElement.getBoundingClientRect();
-      const origin = board.getOrigin();
-      const location = {
-        x:
-          (event.clientX - rect.left - 50 * domElement.boardScale) /
-            domElement.boardScale +
-          origin.x,
-        y:
-          (event.clientY - rect.top - 50 * domElement.boardScale) /
-            domElement.boardScale +
-          origin.y,
-      };
-      const id = board.putSticky({ color: currentColor, location });
-      selectedStickies.replaceSelection(id);
-      renderBoard();
-    } else if (event.target === domElement && !event.shiftKey) {
+    if (nextClickCreatesNewSticky) {} else if (event.target === domElement && !event.shiftKey) {
       selectedStickies.clearSelection();
     }

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:360:9
     }
   };
   domElement.onclick = (event) => {
-    if (nextClickCreatesNewSticky) {
+    if (false) {
       nextClickCreatesNewSticky = false;
       const rect = domElement.getBoundingClientRect();

[Survived] ObjectLiteral
put-it-up/scripts/ui/render-to-dom.js:364:24
       nextClickCreatesNewSticky = false;
       const rect = domElement.getBoundingClientRect();
       const origin = board.getOrigin();
-      const location = {
-        x:
-          (event.clientX - rect.left - 50 * domElement.boardScale) /
-            domElement.boardScale +
-          origin.x,
-        y:
-          (event.clientY - rect.top - 50 * domElement.boardScale) /
-            domElement.boardScale +
-          origin.y,
-      };
+      const location = {};
       const id = board.putSticky({ color: currentColor, location });
       selectedStickies.replaceSelection(id);

[Survived] ArithmeticOperator
put-it-up/scripts/ui/render-to-dom.js:366:40
       const origin = board.getOrigin();
       const location = {
         x:
-          (event.clientX - rect.left - 50 * domElement.boardScale) /
+          (event.clientX - rect.left - 50 / domElement.boardScale) /
             domElement.boardScale +
           origin.x,

[Survived] ArithmeticOperator
put-it-up/scripts/ui/render-to-dom.js:366:12
       const origin = board.getOrigin();
       const location = {
         x:
-          (event.clientX - rect.left - 50 * domElement.boardScale) /
+          (event.clientX + rect.left - 50 * domElement.boardScale) /
             domElement.boardScale +
           origin.x,

[Survived] ArithmeticOperator
put-it-up/scripts/ui/render-to-dom.js:370:12
             domElement.boardScale +
           origin.x,
         y:
-          (event.clientY - rect.top - 50 * domElement.boardScale) /
+          (event.clientY + rect.top - 50 * domElement.boardScale) /
             domElement.boardScale +
           origin.y,

[Survived] ArithmeticOperator
put-it-up/scripts/ui/render-to-dom.js:370:11
             domElement.boardScale +
           origin.x,
         y:
-          (event.clientY - rect.top - 50 * domElement.boardScale) /
-            domElement.boardScale +
-          origin.y,
+          (event.clientY - rect.top - 50 * domElement.boardScale) / domElement.boardScale - origin.y,
       };
       const id = board.putSticky({ color: currentColor, location });

[Survived] LogicalOperator
put-it-up/scripts/ui/render-to-dom.js:377:16
       const id = board.putSticky({ color: currentColor, location });
       selectedStickies.replaceSelection(id);
       renderBoard();
-    } else if (event.target === domElement && !event.shiftKey) {
+    } else if (event.target === domElement || !event.shiftKey) {
       selectedStickies.clearSelection();
     }

[Survived] EqualityOperator
put-it-up/scripts/ui/render-to-dom.js:377:16
       const id = board.putSticky({ color: currentColor, location });
       selectedStickies.replaceSelection(id);
       renderBoard();
-    } else if (event.target === domElement && !event.shiftKey) {
+    } else if (event.target !== domElement && !event.shiftKey) {
       selectedStickies.clearSelection();
     }

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:391:25
 class Selection {
   data = {};
   // TODO: Make this generally observable, make an StickyObservable mixin.
-  constructor(observer) {
-    this.observer = observer;
-  }
+  constructor(observer) {}
   replaceSelection(id) {
     const prevData = this.data;

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:394:24
   constructor(observer) {
     this.observer = observer;
   }
-  replaceSelection(id) {
-    const prevData = this.data;
-    this.data = { [id]: true };
-    Object.keys(prevData).forEach((id) => this.observer.onStickyChange(id));
-    this.observer.onStickyChange(id);
-  }
+  replaceSelection(id) {}
   toggleSelected(id) {
     if (this.data[id]) {

[Survived] BooleanLiteral
put-it-up/scripts/ui/render-to-dom.js:396:25
   }
   replaceSelection(id) {
     const prevData = this.data;
-    this.data = { [id]: true };
+    this.data = { [id]: false };
     Object.keys(prevData).forEach((id) => this.observer.onStickyChange(id));
     this.observer.onStickyChange(id);
