[Survived] ArrowFunction
put-it-up/scripts/ui/render-to-dom.js:397:35
   replaceSelection(id) {
     const prevData = this.data;
     this.data = { [id]: true };
-    Object.keys(prevData).forEach((id) => this.observer.onStickyChange(id));
+    Object.keys(prevData).forEach(() => undefined);
     this.observer.onStickyChange(id);
   }

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:400:22
     Object.keys(prevData).forEach((id) => this.observer.onStickyChange(id));
     this.observer.onStickyChange(id);
   }
-  toggleSelected(id) {
-    if (this.data[id]) {
-      delete this.data[id];
-    } else {
-      this.data[id] = true;
-    }
-    this.observer.onStickyChange(id);
-  }
+  toggleSelected(id) {}
   clearSelection() {
     const prevData = this.data;

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:401:9
     this.observer.onStickyChange(id);
   }
   toggleSelected(id) {
-    if (this.data[id]) {
+    if (true) {
       delete this.data[id];
     } else {

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:401:9
     this.observer.onStickyChange(id);
   }
   toggleSelected(id) {
-    if (this.data[id]) {
+    if (false) {
       delete this.data[id];
     } else {

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:403:12
   toggleSelected(id) {
     if (this.data[id]) {
       delete this.data[id];
-    } else {
-      this.data[id] = true;
-    }
+    } else {}
     this.observer.onStickyChange(id);
   }

[Survived] BooleanLiteral
put-it-up/scripts/ui/render-to-dom.js:404:23
     if (this.data[id]) {
       delete this.data[id];
     } else {
-      this.data[id] = true;
+      this.data[id] = false;
     }
     this.observer.onStickyChange(id);

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:408:20
     }
     this.observer.onStickyChange(id);
   }
-  clearSelection() {
-    const prevData = this.data;
-    this.data = {};
-    Object.keys(prevData).forEach((id) => this.observer.onStickyChange(id));
-  }
+  clearSelection() {}
   isSelected(id) {
     return this.data[id];

[Survived] ArrowFunction
put-it-up/scripts/ui/render-to-dom.js:411:35
   clearSelection() {
     const prevData = this.data;
     this.data = {};
-    Object.keys(prevData).forEach((id) => this.observer.onStickyChange(id));
+    Object.keys(prevData).forEach(() => undefined);
   }
   isSelected(id) {

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:413:18
     this.data = {};
     Object.keys(prevData).forEach((id) => this.observer.onStickyChange(id));
   }
-  isSelected(id) {
-    return this.data[id];
-  }
+  isSelected(id) {}
   hasItems() {
     return this.size() !== 0;

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:416:14
   isSelected(id) {
     return this.data[id];
   }
-  hasItems() {
-    return this.size() !== 0;
-  }
+  hasItems() {}
   forEach(fn) {
     return Object.keys(this.data).forEach(fn);

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:417:12
     return this.data[id];
   }
   hasItems() {
-    return this.size() !== 0;
+    return false;
   }
   forEach(fn) {

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:417:12
     return this.data[id];
   }
   hasItems() {
-    return this.size() !== 0;
+    return true;
   }
   forEach(fn) {

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:419:15
   hasItems() {
     return this.size() !== 0;
   }
-  forEach(fn) {
-    return Object.keys(this.data).forEach(fn);
-  }
+  forEach(fn) {}
   size() {
     return Object.keys(this.data).length;

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:422:10
   forEach(fn) {
     return Object.keys(this.data).forEach(fn);
   }
-  size() {
-    return Object.keys(this.data).length;
-  }
+  size() {}
 }
 

[Survived] BlockStatement
put-it-up/scripts/ui/render-to-dom.js:435:33
   `;
 }
 
-function isChildOf(element, cn) {
-  if (element.classList && element.classList.contains(cn)) {
-    return true;
-  }
-  return element.parentNode && isChildOf(element.parentNode, cn);
-}
+function isChildOf(element, cn) {}
 

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:436:7
 }
 
 function isChildOf(element, cn) {
-  if (element.classList && element.classList.contains(cn)) {
+  if (false) {
     return true;
   }

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:436:7
 }
 
 function isChildOf(element, cn) {
-  if (element.classList && element.classList.contains(cn)) {
+  if (true) {
     return true;
   }

[Survived] BooleanLiteral
put-it-up/scripts/ui/render-to-dom.js:437:12
 
 function isChildOf(element, cn) {
   if (element.classList && element.classList.contains(cn)) {
-    return true;
+    return false;
   }
   return element.parentNode && isChildOf(element.parentNode, cn);

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:439:10
   if (element.classList && element.classList.contains(cn)) {
     return true;
   }
-  return element.parentNode && isChildOf(element.parentNode, cn);
+  return false;
 }
 

[Survived] ConditionalExpression
put-it-up/scripts/ui/render-to-dom.js:439:10
   if (element.classList && element.classList.contains(cn)) {
     return true;
   }
-  return element.parentNode && isChildOf(element.parentNode, cn);
+  return true;
 }
 
